# [4]  EDA Part 1 - Cleaning

---
With all my data now stored in SQL, I can now begin exploratory data analysis. The size of the Lending Club dataset is very large and will therefore require extensive cleaning. I will also need to map the median household income (US Census data) to the zip code of the borrower.

---

In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

engine = create_engine('postgresql://postgres:database@localhost:5432/Capstone')

In [2]:
# Read in loan dataset from SQL database.
SQL_STRING = '''

select * from "Lending Club"

'''

df = pd.read_sql(SQL_STRING, con=engine)

In [3]:
df.head()

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,...,hardship_payoff_balance_amount,hardship_last_payment_amount,disbursement_method,debt_settlement_flag,debt_settlement_flag_date,settlement_status,settlement_date,settlement_amount,settlement_percentage,settlement_term
0,1,None,5000.0,5000.0,4975.0,36 months,10.65%,162.87,B,B2,...,NaN,NaN,Cash,N,None,None,None,NaN,NaN,NaN
1,2,None,2500.0,2500.0,2500.0,60 months,15.27%,59.83,C,C4,...,NaN,NaN,Cash,N,None,None,None,NaN,NaN,NaN
2,3,None,2400.0,2400.0,2400.0,36 months,15.96%,84.33,C,C5,...,NaN,NaN,Cash,N,None,None,None,NaN,NaN,NaN
3,4,None,10000.0,10000.0,10000.0,36 months,13.49%,339.31,C,C1,...,NaN,NaN,Cash,N,None,None,None,NaN,NaN,NaN
4,5,None,3000.0,3000.0,3000.0,60 months,12.69%,67.79,B,B5,...,NaN,NaN,Cash,N,None,None,None,NaN,NaN,NaN

In [4]:
df.shape

(1765427, 145)

## Target - Default / Fully Paid

---
The goal of the project is to predict whether or not someone will default on their loan. Therefore, I need to explore the loan_status column to check the unique classes in this column.

---

In [5]:
df.loan_status.value_counts()

Current                                                843754
Fully Paid                                             698690
Charged Off                                            182199
Late (31-120 days)                                      21742
In Grace Period                                         11812
Late (16-30 days)                                        4423
Does not meet the credit policy. Status:Fully Paid       1988
Does not meet the credit policy. Status:Charged Off       761
Default                                                    57
Name: loan_status, dtype: int64

---
Because I am trying to predict which loans default, I am only interested in the loans that have come to completion and have either been fully paid or defaulted.

The value counts shows that there are nearly 850,000 loans that are still 'Current', i.e. have not fully paid off their loan or defaulted but are still in the process of paying back the loan. There are a number of other categories, such as 'Late' and 'In Grace Period'. I do not know whether these loans will end up defaulting or being fully paid so I will drop the records for these categories.

There are only 57 records that are listed as 'Default'. However, there are more than 180,000 records listed as 'Charged Off'. Lending club defines 'Default' as 120+ days past due. 'Charged Off'  is defined as 150+ days past due with no expectation of the loan being paid. For the purpose of this project, I will group these two categories together as 'Default'.

---

In [6]:
# Slice dataframe to only include loans that are 'Fully Paid', 'Charged Off', or 'Default'.
loan = df[(df.loan_status == 'Fully Paid') | (df.loan_status == 'Charged Off') | (df.loan_status == 'Default')]

In [7]:
loan.loan_status.value_counts()

Fully Paid     698690
Charged Off    182199
Default            57
Name: loan_status, dtype: int64

In [8]:
loan.shape

(880946, 145)

---
I am now left with 880,000 records. I will group 'Charged Off' and 'Default' into a single 'Default' class.

---

In [9]:
# Rename 'Charged Off' records to 'Default'.
loan.loan_status = loan.loan_status.map(lambda x: 'Default' if x=='Charged Off' else x)

/Applications/anaconda2/envs/py36/lib/python3.6/site-packages/pandas/core/generic.py:3643: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[name] = value

In [10]:
loan.loan_status.value_counts()

Fully Paid    698690
Default       182256
Name: loan_status, dtype: int64

---
I now have to classes in my target variable. I will binarise this column whereby 'Default' will become 1 and 'Fully Paid' will be 0.

---

In [11]:
# Rename 'Default' records to 1, all others to 0.
loan.loan_status = loan.loan_status.map(lambda x: 1 if x=='Default' else 0)

/Applications/anaconda2/envs/py36/lib/python3.6/site-packages/pandas/core/generic.py:3643: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[name] = value

In [12]:
loan.loan_status.value_counts()

0    698690
1    182256
Name: loan_status, dtype: int64

---
With the target column processed, I can now explore all of the other features.

---

## Dropping NaN Columns

---
Having looked at the data, there appear to be a lot of columns with many NaN/None values. These columns will not have enough (if any) data to act as a predictor so they will need to be dropped. I will start by removing columns that have at least 50% NaNs.

---

In [13]:
# Create dataframe with percentage of nulls per column.
nulls = (loan.isnull().sum()/loan.shape[0]).to_frame()  # Number of nulls over total number of records for each column.
nulls['column'] = loan.columns
nulls.columns = ['null_pcnt', 'column']

In [14]:
nulls.head(15)

                     null_pcnt               column
id                    0.000000                   id
member_id             1.000000            member_id
loan_amnt             0.000000            loan_amnt
funded_amnt           0.000000          funded_amnt
funded_amnt_inv       0.000000      funded_amnt_inv
term                  0.000000                 term
int_rate              0.000000             int_rate
installment           0.000000          installment
grade                 0.000000                grade
sub_grade             0.000000            sub_grade
emp_title             0.059874            emp_title
emp_length            0.052643           emp_length
home_ownership        0.000000       home_ownership
annual_inc            0.000000           annual_inc
verification_status   0.000000  verification_status

In [15]:
# Now create a list of columns with more than 50% nulls
many_nulls = nulls[nulls.null_pcnt >= 0.5]
null_cols = list(many_nulls.column)
print(len(null_cols))

57

---
There are 57 columns that have at least 50% null values.

---

In [16]:
null_cols

['member_id',
 'url',
 'desc',
 'mths_since_last_delinq',
 'mths_since_last_record',
 'next_pymnt_d',
 'mths_since_last_major_derog',
 'annual_inc_joint',
 'dti_joint',
 'verification_status_joint',
 'open_acc_6m',
 'open_act_il',
 'open_il_12m',
 'open_il_24m',
 'mths_since_rcnt_il',
 'total_bal_il',
 'il_util',
 'open_rv_12m',
 'open_rv_24m',
 'max_bal_bc',
 'all_util',
 'inq_fi',
 'total_cu_tl',
 'inq_last_12m',
 'mths_since_recent_bc_dlq',
 'mths_since_recent_revol_delinq',
 'revol_bal_joint',
 'sec_app_earliest_cr_line',
 'sec_app_inq_last_6mths',
 'sec_app_mort_acc',
 'sec_app_open_acc',
 'sec_app_revol_util',
 'sec_app_open_act_il',
 'sec_app_num_rev_accts',
 'sec_app_chargeoff_within_12_mths',
 'sec_app_collections_12_mths_ex_med',
 'sec_app_mths_since_last_major_derog',
 'hardship_type',
 'hardship_reason',
 'hardship_status',
 'deferral_term',
 'hardship_amount',
 'hardship_start_date',
 'hardship_end_date',
 'payment_plan_start_date',
 'hardship_length',
 'hardship_dpd',
 'hardship_loan_status',
 'orig_projected_additional_accrued_interest',
 'hardship_payoff_balance_amount',
 'hardship_last_payment_amount',
 'debt_settlement_flag_date',
 'settlement_status',
 'settlement_date',
 'settlement_amount',
 'settlement_percentage',
 'settlement_term']

In [17]:
# Now drop the columns with at least 50% nulls.
loan.drop(null_cols, axis=1, inplace=True)

/Applications/anaconda2/envs/py36/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [18]:
loan.shape

(880946, 88)

## Datetime

---
Several columns relate to a date. I will convert these date columns to datetime objects.

---

In [19]:
print (loan.issue_d.dtype)
print (loan.earliest_cr_line.dtype)
print (loan.last_pymnt_d.dtype)
print (loan.last_credit_pull_d.dtype)

object
object
object
object

In [20]:
# Convert columns from object to datetime.
loan.issue_d = pd.to_datetime(loan.issue_d)
loan.earliest_cr_line = pd.to_datetime(loan.earliest_cr_line)
loan.last_pymnt_d = pd.to_datetime(loan.last_pymnt_d)
loan.last_credit_pull_d = pd.to_datetime(loan.last_credit_pull_d)

/Applications/anaconda2/envs/py36/lib/python3.6/site-packages/pandas/core/generic.py:3643: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[name] = value

In [21]:
print (loan.issue_d.dtype)
print (loan.earliest_cr_line.dtype)
print (loan.last_pymnt_d.dtype)
print (loan.last_credit_pull_d.dtype)

datetime64[ns]
datetime64[ns]
datetime64[ns]
datetime64[ns]

---
The columns where more than 50% of the values are NaN have now been removed. Date columns have also been converted to datetime. I will push this cleaned dataframe into a new SQL table. I will regularly push the dataframe into new SQL tables to save any changes as I continue to clean and preprocess the data.

---

In [22]:
loan.to_sql(name='LC_Cleaning', con=engine, if_exists='replace', index = False)

## Other Columns

---
Now I will explore and clean the other columns.

---

In [23]:
# Read in cleaned table.
SQL_STRING = '''

select * from "LC_Cleaning"

'''

df = pd.read_sql(SQL_STRING, con=engine)

In [24]:
df.head()

,id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,emp_title,...,percent_bc_gt_75,pub_rec_bankruptcies,tax_liens,tot_hi_cred_lim,total_bal_ex_mort,total_bc_limit,total_il_high_credit_limit,hardship_flag,disbursement_method,debt_settlement_flag
0,1,5000.0,5000.0,4975.0,36 months,10.65%,162.87,B,B2,None,...,NaN,0.0,0.0,None,None,None,None,N,Cash,N
1,2,2500.0,2500.0,2500.0,60 months,15.27%,59.83,C,C4,Ryder,...,NaN,0.0,0.0,None,None,None,None,N,Cash,N
2,3,2400.0,2400.0,2400.0,36 months,15.96%,84.33,C,C5,None,...,NaN,0.0,0.0,None,None,None,None,N,Cash,N
3,4,10000.0,10000.0,10000.0,36 months,13.49%,339.31,C,C1,AIR RESOURCES BOARD,...,NaN,0.0,0.0,None,None,None,None,N,Cash,N
4,5,3000.0,3000.0,3000.0,60 months,12.69%,67.79,B,B5,University Medical Group,...,NaN,0.0,0.0,None,None,None,None,N,Cash,N

In [25]:
df.shape

(880946, 88)

### Dropping Irrelevant Columns

---
There are still more than 80 features in the dataset. I will want to reduce this before modelling but dropping any irrelevant and unnecessary features. The problem I am trying to solve is to predict whether someone defaults on their loan. Therefore, any features related to what happens after a loan has defaulted, such as collection, hardship, and settlement plans, are irrelevant to the question. I will now drop columns that pertain to what happens after a loan has defaulted / been paid off.

---

In [26]:
df.drop(['recoveries', 'collection_recovery_fee', 'collections_12_mths_ex_med', 'hardship_flag',
         'debt_settlement_flag'], axis=1, inplace=True)

In [27]:
df.shape

(880946, 83)

---
There are also columns related to what happens during a loan, such as dates of payments, how much in payments the investor has received, the total amount of interest/principal that the borrower ended up paying. These are not important features for predicting whether someone will actually default. I will drop these columns too.

---

In [28]:
df.drop(['out_prncp', 'out_prncp_inv', 'total_pymnt', 'total_pymnt_inv', 'total_rec_prncp', 'total_rec_int',
        'total_rec_late_fee', 'last_pymnt_d', 'last_pymnt_amnt', 'last_credit_pull_d'], axis=1, inplace=True)

In [29]:
df.shape

(880946, 73)

---
For my model, I will only be looking at individual loans. I will not include joint loans that have a secondary applicant. I have already dropped most columns related to joint loans and the secondary applicant due to high proportions of NaNs. I will now drop any other columns related to this and also any rows that contain joint loans.

The column application_type indicates whether the loan is an individual application or a joint application. I will slice the dataframe to include only the individual applications and then drop the column.

---

In [30]:
df.application_type.value_counts()

Individual    875697
Joint App       5249
Name: application_type, dtype: int64

---
The vast majority are individual loans.

---

In [31]:
# Slice dataframe to only include individual loans.
df = df[df.application_type == 'Individual']

In [32]:
# Drop application_type column.
df.drop(['application_type'], axis=1, inplace=True)

In [33]:
df.shape

(875697, 72)

In [34]:
df.pymnt_plan.value_counts()

n    875697
Name: pymnt_plan, dtype: int64

---
All values are the same, 'n' (no payment plan), so I will drop the column.

---

In [35]:
df.drop(['pymnt_plan'], axis=1, inplace=True)

### Nulls in Other Columns

---
Having dropped features that are irrelevant to whether a loan defaults or not, I will now check the values of other columns that have some relevance to the question. I will start by seeing which columns still have null values and then decide what to do with them.

---

In [36]:
# Create dataframe to calculate percentage of nulls per column.
nulls = (df.isnull().sum()/df.shape[0]).to_frame()

In [37]:
nulls.columns = ['null_pcnt']

In [38]:
nulls.null_pcnt.sort_values(ascending=False).head(40)

mths_since_recent_inq         0.141687
num_tl_120dpd_2m              0.109628
mo_sin_old_il_acct            0.104376
pct_tl_nvr_dlq                0.077271
avg_cur_bal                   0.077127
mo_sin_rcnt_rev_tl_op         0.077113
mo_sin_old_rev_tl_op          0.077113
num_rev_accts                 0.077113
num_il_tl                     0.077112
mo_sin_rcnt_tl                0.077112
tot_hi_cred_lim               0.077112
tot_cur_bal                   0.077112
num_accts_ever_120_pd         0.077112
num_actv_bc_tl                0.077112
num_actv_rev_tl               0.077112
num_tl_op_past_12m            0.077112
num_bc_tl                     0.077112
total_il_high_credit_limit    0.077112
num_op_rev_tl                 0.077112
num_rev_tl_bal_gt_0           0.077112
tot_coll_amt                  0.077112
total_rev_hi_lim              0.077112
num_tl_30dpd                  0.077112
num_tl_90g_dpd_24m            0.077112
bc_util                       0.064378
percent_bc_gt_75              0.064095
num_bc_sats                   0.063767
num_sats                      0.063767
bc_open_to_buy                0.063766
mths_since_recent_bc          0.063046
emp_title                     0.059465
acc_open_past_24mths          0.053992
total_bc_limit                0.053992
mort_acc                      0.053992
total_bal_ex_mort             0.053992
emp_length                    0.052186
title                         0.009844
pub_rec_bankruptcies          0.000796
revol_util                    0.000596
chargeoff_within_12_mths      0.000064
Name: null_pcnt, dtype: float64

---
A number of columns still have null values. mths_since_recent_inq (months since most recent inquiry) contains more than 14% NaN's. I have another column related to inquiries which is inq_last_6mths (inquiries last 6 months). The inquiries which these columns are referring to are credit inquiries. These are hard credit inquiries which show up on someone's credit report when they have applied for a loan or credit (Lending Club does not include mortgage and auto loan inquiries in the data). Therefore, a high number of inquiries in the preceding 6 months could indicate that that person is in high need of the money and, therefore, would likely be a better indicator of defaults than the number of months since last inquiry. Therefore, I will drop mths_since_recent_inq.

---

In [39]:
df.drop('mths_since_recent_inq', axis=1, inplace=True)

---
mo_sin_old_il_acct (months since oldest instalment account opened) has more than 10% NaN's. mo_sin_rcnt_rev_tl_op (months since most recent revolving account opened) and mo_sin_old_rev_tl_op (months since oldest revolving account opened) have more than 7% NaN's. As with inquiries, the total number of accounts, credit limits, utilisation rates, etc. are more likely to have an impact on default rate than the number of months since someone has recently opended an account. The number of months since someone first opened an instalment/revolving account (i.e. for how long they have been using loans / had a line of credit) could have an effect. However, I also have the column earliest_cr_line (earliest credit line). Therefore, I will use earliest_cr_line and drop the other columns related to date of opening an account.

---

In [40]:
df.drop(['mo_sin_old_il_acct', 'mo_sin_old_rev_tl_op', 'mo_sin_rcnt_rev_tl_op', 'mo_sin_rcnt_tl',
         'mths_since_recent_bc',], axis=1, inplace=True)

#### No Pre-2012 Data

---
A recent Lending Club blog (https://blog.lendingclub.com/additional-data-in-issued-loans-csv-download-file/) stated that they have recently included a number of new features in their datasets that were not previously available. However, many of these new features contain data that only goes as far back as 2012. My data goes back to 2007. Therefore, I cannot use features that do not include data for half the years that I have loan data for. I will therefore check the rest of these features that have more than 5% nulls and remove them if they do not have data from before 2012.

---

In [41]:
# Number of Accounts 120 Days Past Due Last 2 Months
SQL_STRING = '''

select issue_d, num_tl_120dpd_2m from "LC_Cleaning"
where num_tl_120dpd_2m is not null
order by issue_d

'''
# Select feature and loan issue date where feature does not contain nulls.
# Sort by issue date to find first date that has data for this feature.

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d  num_tl_120dpd_2m
0 2012-08-01               0.0
1 2012-08-01               0.0
2 2012-08-01               0.0

In [42]:
# Percentage of Accounts Never Delinquent
SQL_STRING = '''

select issue_d, pct_tl_nvr_dlq from "LC_Cleaning"
where pct_tl_nvr_dlq is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d  pct_tl_nvr_dlq
0 2012-08-01           100.0
1 2012-08-01           100.0
2 2012-08-01           100.0

In [43]:
# Average Current Balance
SQL_STRING = '''

select issue_d, avg_cur_bal from "LC_Cleaning"
where avg_cur_bal is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d avg_cur_bal
0 2012-08-01     18902.0
1 2012-08-01      3556.0
2 2012-08-01      3684.0

In [44]:
# Number of Revolving Accounts
SQL_STRING = '''

select issue_d, num_rev_accts from "LC_Cleaning"
where num_rev_accts is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d num_rev_accts
0 2012-08-01          27.0
1 2012-08-01          17.0
2 2012-08-01          11.0

In [45]:
# Number of Instalment Accounts
SQL_STRING = '''

select issue_d, num_il_tl from "LC_Cleaning"
where num_il_tl is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d num_il_tl
0 2012-08-01       4.0
1 2012-08-01      10.0
2 2012-08-01      11.0

In [46]:
# Total high credit/credit limit
SQL_STRING = '''

select issue_d, tot_hi_cred_lim from "LC_Cleaning"
where tot_hi_cred_lim is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d tot_hi_cred_lim
0 2012-08-01         51892.0
1 2012-08-01         83557.0
2 2012-08-01         58087.0

In [47]:
# Total Current Balance
SQL_STRING = '''

select issue_d, tot_cur_bal from "LC_Cleaning"
where tot_cur_bal is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d tot_cur_bal
0 2012-08-01    147739.0
1 2012-08-01     24351.0
2 2012-08-01      4879.0

In [48]:
# Number of Accounts Ever 120 Days Past Due
SQL_STRING = '''

select issue_d, num_accts_ever_120_pd from "LC_Cleaning"
where num_accts_ever_120_pd is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d num_accts_ever_120_pd
0 2012-08-01                   1.0
1 2012-08-01                   0.0
2 2012-08-01                   0.0

In [49]:
# Number of Active Bankcard Accounts
SQL_STRING = '''

select issue_d, num_actv_bc_tl from "LC_Cleaning"
where num_actv_bc_tl is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d num_actv_bc_tl
0 2012-08-01            3.0
1 2012-08-01            2.0
2 2012-08-01            4.0

In [50]:
# Number of Active Revolving Accounts
SQL_STRING = '''

select issue_d, num_actv_rev_tl from "LC_Cleaning"
where num_actv_rev_tl is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d num_actv_rev_tl
0 2012-08-01             4.0
1 2012-08-01             6.0
2 2012-08-01             7.0

In [51]:
# Number of Accounts Open Past 12 Months
SQL_STRING = '''

select issue_d, num_tl_op_past_12m from "LC_Cleaning"
where num_tl_op_past_12m is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d num_tl_op_past_12m
0 2012-08-01                0.0
1 2012-08-01                2.0
2 2012-08-01                1.0

In [52]:
# Number of Bankcard Accounts
SQL_STRING = '''

select issue_d, num_bc_tl from "LC_Cleaning"
where num_bc_tl is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d num_bc_tl
0 2012-08-01      16.0
1 2012-08-01       9.0
2 2012-08-01       8.0

In [53]:
# Total instalment high credit/credit limit
SQL_STRING = '''

select issue_d, total_il_high_credit_limit from "LC_Cleaning"
where total_il_high_credit_limit is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d total_il_high_credit_limit
0 2012-08-01                    32675.0
1 2012-08-01                        0.0
2 2012-08-01                     8192.0

In [54]:
# Number of Open Revolving Accounts
SQL_STRING = '''

select issue_d, num_op_rev_tl from "LC_Cleaning"
where num_op_rev_tl is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d num_op_rev_tl
0 2012-08-01           7.0
1 2012-08-01          10.0
2 2012-08-01           7.0

In [55]:
# Number of Revolving Accounts with Balance Greater than 0
SQL_STRING = '''

select issue_d, num_rev_tl_bal_gt_0 from "LC_Cleaning"
where num_rev_tl_bal_gt_0 is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d num_rev_tl_bal_gt_0
0 2012-08-01                 4.0
1 2012-08-01                 6.0
2 2012-08-01                 7.0

In [56]:
# Total Collection Amount
SQL_STRING = '''

select issue_d, tot_coll_amt from "LC_Cleaning"
where tot_coll_amt is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d tot_coll_amt
0 2012-08-01          0.0
1 2012-08-01          0.0
2 2012-08-01          0.0

In [57]:
# Total Revolving High Limit
SQL_STRING = '''

select issue_d, total_rev_hi_lim from "LC_Cleaning"
where total_rev_hi_lim is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d total_rev_hi_lim
0 2012-08-01           5900.0
1 2012-08-01          28000.0
2 2012-08-01          42300.0

In [58]:
# Number of Accounts 30 Days Past Due
SQL_STRING = '''

select issue_d, num_tl_30dpd from "LC_Cleaning"
where num_tl_30dpd is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d num_tl_30dpd
0 2012-08-01          0.0
1 2012-08-01          0.0
2 2012-08-01          0.0

In [59]:
# Number of Accounts 90+ Days Past Due Last 24 Months
SQL_STRING = '''

select issue_d, num_tl_90g_dpd_24m from "LC_Cleaning"
where num_tl_90g_dpd_24m is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d num_tl_90g_dpd_24m
0 2012-08-01                0.0
1 2012-08-01                0.0
2 2012-08-01                0.0

In [60]:
# Bankcard Utilisation Rate
SQL_STRING = '''

select issue_d, bc_util from "LC_Cleaning"
where bc_util is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d  bc_util
0 2012-03-01     48.2
1 2012-03-01     94.6
2 2012-03-01     89.6

In [61]:
# Percentage Bankcards Greater than 75% Limit
SQL_STRING = '''

select issue_d, percent_bc_gt_75 from "LC_Cleaning"
where percent_bc_gt_75 is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d  percent_bc_gt_75
0 2012-03-01              75.0
1 2012-03-01             100.0
2 2012-03-01              54.5

In [62]:
# Number of Satisfactory Bankcards
SQL_STRING = '''

select issue_d, num_bc_sats from "LC_Cleaning"
where num_bc_sats is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d num_bc_sats
0 2012-06-01         2.0
1 2012-06-01         2.0
2 2012-06-01         7.0

In [63]:
# Number of Satisfactory Accounts
SQL_STRING = '''

select issue_d, num_sats from "LC_Cleaning"
where num_sats is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d num_sats
0 2012-06-01      4.0
1 2012-06-01      5.0
2 2012-06-01     13.0

In [64]:
# Bankcards Open to Buy
SQL_STRING = '''

select issue_d, bc_open_to_buy from "LC_Cleaning"
where bc_open_to_buy is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d  bc_open_to_buy
0 2012-03-01          3668.0
1 2012-03-01          1567.0
2 2012-03-01          9459.0

In [65]:
# Employment Title
SQL_STRING = '''

select issue_d, emp_title from "LC_Cleaning"
where emp_title is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d              emp_title
0 2007-06-01       Evergreen Center
1 2007-07-01  The Dartmouth Company
2 2007-07-01                    FDA

In [66]:
# Accounts Opened Past 24 Months
SQL_STRING = '''

select issue_d, acc_open_past_24mths from "LC_Cleaning"
where acc_open_past_24mths is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d acc_open_past_24mths
0 2012-03-01                  7.0
1 2012-03-01                  2.0
2 2012-03-01                  3.0

In [67]:
# Total bankcard high credit/credit limit
SQL_STRING = '''

select issue_d, total_bc_limit from "LC_Cleaning"
where total_bc_limit is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d total_bc_limit
0 2012-03-01         8200.0
1 2012-03-01        32000.0
2 2012-03-01        34129.0

In [68]:
# Number of Mortgage Accounts
SQL_STRING = '''

select issue_d, mort_acc from "LC_Cleaning"
where mort_acc is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d mort_acc
0 2012-03-01      0.0
1 2012-03-01      0.0
2 2012-03-01      3.0

In [69]:
# Total credit balance excluding mortgage
SQL_STRING = '''

select issue_d, total_bal_ex_mort from "LC_Cleaning"
where total_bal_ex_mort is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d total_bal_ex_mort
0 2012-03-01           27219.0
1 2012-03-01           81607.0
2 2012-03-01           23214.0

In [70]:
# Employment Length
SQL_STRING = '''

select issue_d, emp_length from "LC_Cleaning"
where emp_length is not null
order by issue_d

'''

df2 = pd.read_sql(SQL_STRING, con=engine)
df2.head(3)

     issue_d emp_length
0 2007-06-01   < 1 year
1 2007-07-01   < 1 year
2 2007-07-01   < 1 year

---
Of these columns, only emp_title (employment title) and emp_length (employment length) have data going back to 2007. None of the others have data for the previous 5 years before 2012. Therefore, I will remove the columns without pre-2012 data.

---

In [71]:
df.drop(['num_tl_120dpd_2m', 'pct_tl_nvr_dlq', 'avg_cur_bal', 'num_rev_accts', 'num_il_tl', 'tot_hi_cred_lim',
        'tot_cur_bal', 'num_accts_ever_120_pd', 'num_actv_bc_tl', 'num_actv_rev_tl', 'num_tl_op_past_12m',
        'num_bc_tl', 'total_il_high_credit_limit', 'num_op_rev_tl', 'num_rev_tl_bal_gt_0', 'tot_coll_amt',
        'total_rev_hi_lim', 'num_tl_30dpd', 'num_tl_90g_dpd_24m', 'bc_util', 'percent_bc_gt_75', 'num_bc_sats',
        'num_sats', 'bc_open_to_buy', 'acc_open_past_24mths', 'total_bc_limit', 'mort_acc', 'total_bal_ex_mort'],
        axis=1, inplace=True)

#### Null Rows

In [72]:
nulls = (df.isnull().sum()/df.shape[0]).to_frame()
nulls.columns = ['null_pcnt']
nulls.null_pcnt.sort_values(ascending=False).head(10)

emp_title                   0.059465
emp_length                  0.052186
title                       0.009844
pub_rec_bankruptcies        0.000796
revol_util                  0.000596
chargeoff_within_12_mths    0.000064
tax_liens                   0.000045
inq_last_6mths              0.000001
disbursement_method         0.000000
sub_grade                   0.000000
Name: null_pcnt, dtype: float64

---
There are still some columns that have NaN's, however, apart from employment title and employment length, the percentage of nulls is less than 1%. Because I have so many records, I can now remove any rows that contain null values. I will still have more than 800,000 records left once this is done.

---

In [73]:
df.dropna(axis=0, how='any', inplace=True)
# Drop rows that contain any null values.

In [74]:
df.shape

(814617, 37)

In [75]:
df.to_sql(name='LC_Cleaning2', con=engine, if_exists='replace', index = False)
# Push to SQL to save changes.

### Categorical Columns

---
Now that I have dropped all records containing null values, I will check the values in the categorical columns to see if they need cleaning.

---

In [76]:
SQL_STRING = '''

select * from "LC_Cleaning2"

'''

df = pd.read_sql(SQL_STRING, con=engine)

In [77]:
df.shape

(814617, 37)

In [78]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 814617 entries, 0 to 814616
Data columns (total 37 columns):
id                          814617 non-null int64
loan_amnt                   814617 non-null float64
funded_amnt                 814617 non-null float64
funded_amnt_inv             814617 non-null float64
term                        814617 non-null object
int_rate                    814617 non-null object
installment                 814617 non-null float64
grade                       814617 non-null object
sub_grade                   814617 non-null object
emp_title                   814617 non-null object
emp_length                  814617 non-null object
home_ownership              814617 non-null object
annual_inc                  814617 non-null float64
verification_status         814617 non-null object
issue_d                     814617 non-null datetime64[ns]
loan_status                 814617 non-null int64
purpose                     814617 non-null object
title                       814617 non-null object
zip_code                    814617 non-null object
addr_state                  814617 non-null object
dti                         814617 non-null float64
delinq_2yrs                 814617 non-null float64
earliest_cr_line            814617 non-null datetime64[ns]
inq_last_6mths              814617 non-null float64
open_acc                    814617 non-null float64
pub_rec                     814617 non-null float64
revol_bal                   814617 non-null float64
revol_util                  814617 non-null object
total_acc                   814617 non-null float64
initial_list_status         814617 non-null object
policy_code                 814617 non-null float64
acc_now_delinq              814617 non-null float64
chargeoff_within_12_mths    814617 non-null float64
delinq_amnt                 814617 non-null float64
pub_rec_bankruptcies        814617 non-null float64
tax_liens                   814617 non-null float64
disbursement_method         814617 non-null object
dtypes: datetime64[ns](2), float64(18), int64(2), object(15)
memory usage: 230.0+ MB

---
I will be looking at the columns that are of type object.

---

In [79]:
df.term.value_counts()

 36 months    614376
 60 months    200241
Name: term, dtype: int64

In [80]:
df.int_rate.value_counts().head()

 10.99%    26101
 12.99%    19553
 11.99%    18491
 15.61%    17063
 13.99%    16253
Name: int_rate, dtype: int64

---
The values in the int_rate (interest rate) column have a percentage sign (%) at the end. I will need to remove these percentage signs and then convert the column to float type.

---

In [81]:
df.int_rate = df.int_rate.str.replace('%', '')    # Remove '%' from records.

In [82]:
df.int_rate.value_counts().head()

 10.99    26101
 12.99    19553
 11.99    18491
 15.61    17063
 13.99    16253
Name: int_rate, dtype: int64

In [83]:
df.int_rate = df.int_rate.map(lambda x: float(x))   # Convert to float.
df.int_rate.dtype

dtype('float64')

In [84]:
df.grade.value_counts()

B    235267
C    226612
A    135900
D    125627
E     62623
F     22627
G      5961
Name: grade, dtype: int64

In [85]:
df.sub_grade.value_counts()

B3    51013
B4    50982
C1    50335
C2    47853
B5    47844
C3    44911
B2    44586
C4    43997
B1    40842
C5    39516
A5    38614
D1    32042
A4    31776
D2    27753
D3    24139
D4    22781
A1    22759
A3    21810
A2    20941
D5    18912
E1    16072
E2    14542
E3    12262
E4    10574
E5     9173
F1     6928
F2     5160
F3     4361
F4     3455
F5     2723
G1     1965
G2     1480
G3     1054
G4      818
G5      644
Name: sub_grade, dtype: int64

---
This page, https://www.lendingclub.com/foliofn/rateDetail.action, shows how grade and sub_grade are used to calculate the interest rate on a loan. Lending Club assigns a grade and sub_grade based on credit risk indicators in the credit report. This sub_grade then determines the interest rate of the loan. Therefore, all of these features would be highly correlated so I will drop grade and sub_grade and keep interest rate.

---

In [86]:
df.drop(['grade', 'sub_grade'], axis=1, inplace=True)

In [87]:
df.emp_title.value_counts()

Teacher                                    12305
Manager                                    11400
Registered Nurse                            5217
RN                                          5103
Supervisor                                  4965
Owner                                       4952
Sales                                       4434
Driver                                      4050
Project Manager                             3911
Office Manager                              3224
General Manager                             3054
Director                                    3026
manager                                     2863
Engineer                                    2639
teacher                                     2545
owner                                       2380
driver                                      2289
President                                   2264
Vice President                              2144
Operations Manager                          2086
Accountant                                  2050
Administrative Assistant                    1904
Sales Manager                               1859
Attorney                                    1847
Account Manager                             1707
Police Officer                              1703
sales                                       1636
Analyst                                     1621
Executive Assistant                         1579
supervisor                                  1570
                                           ...
Rockford Construction Company                  1
Transition to Home Associate                   1
Gannett business solutions                     1
PL Engineering, P.C.                           1
The Brickmangroup                              1
Director of Child Nutrition an Wellness        1
lio chem inc                                   1
director public works                          1
Quality Custom Distribution                    1
Simpson Manufacturing                          1
accounts receivable specialist                 1
Intl'l rep                                     1
Community Residential Services                 1
Maruyama US Inc                                1
Services Advisor                               1
Sanmina-sci corp                               1
Account recruiting manager                     1
Adninistrative Associate                       1
Academic Partnerships                          1
AutoGenomics, Inc.                             1
Commonwealth Electrical Technologies           1
Bross Group                                    1
precision machine specialist                   1
Vice President Sr. Business Specialist         1
schwans                                        1
CSDR                                           1
A I Manager                                    1
SnakeTray                                      1
Advertising Dept. Assistant                    1
Defense  and  Confirmation Project             1
Name: emp_title, Length: 290742, dtype: int64

---
There are many unique values for employment title so I will group them into new categories at a later stage.

---

In [88]:
df.emp_length.value_counts()

10+ years    279522
2 years       77997
3 years       68691
< 1 year      67892
1 year        56357
5 years       54694
4 years       51514
6 years       42246
7 years       41125
8 years       40938
9 years       33641
Name: emp_length, dtype: int64

In [89]:
df.home_ownership.value_counts()

MORTGAGE    406408
RENT        328556
OWN          79376
OTHER          136
ANY            100
NONE            41
Name: home_ownership, dtype: int64

---
The data dictionary lists the values in home_ownership as being 'RENT', 'OWN', 'MORTGAGE', and 'OTHER'. However, my data has two other categories: 'ANY' and 'NONE'. No description has been provided as to what these two categories mean compared with 'OTHER'. Between 'OTHER', 'ANY', and 'NONE', there are only 277 records with 'OTHER' being the largest category. Therefore, I will group 'ANY' and 'NONE' with 'OTHER' into one category.

---

In [90]:
df.home_ownership = df.home_ownership.map(lambda x: 'OTHER' if x in ['ANY', 'NONE'] else x)
# Rename 'ANY' and 'NONE' to 'OTHER'.

In [91]:
df.home_ownership.value_counts()

MORTGAGE    406408
RENT        328556
OWN          79376
OTHER          277
Name: home_ownership, dtype: int64

In [92]:
df.verification_status.value_counts()

Source Verified    304662
Not Verified       259225
Verified           250730
Name: verification_status, dtype: int64

In [93]:
df.purpose.value_counts()

debt_consolidation    483362
credit_card           175243
home_improvement       50060
other                  43716
major_purchase         17431
small_business          9363
car                     8984
medical                 8572
moving                  5683
vacation                5044
house                   4109
wedding                 2179
renewable_energy         592
educational              279
Name: purpose, dtype: int64

In [94]:
df.title.value_counts().head(40)

Debt consolidation           383478
Credit card refinancing      137612
Home improvement              39851
Other                         34280
Debt Consolidation            14585
Major purchase                12780
Medical expenses               6935
Business                       6679
Car financing                  5994
Consolidation                  4927
Moving and relocation          4362
debt consolidation             4276
Vacation                       4224
Debt Consolidation Loan        3549
Home buying                    2942
Credit Card Consolidation      2175
consolidation                  1938
Personal Loan                  1937
Consolidation Loan             1650
Home Improvement               1579
Credit Card Refinance          1361
Credit Card Payoff             1268
Consolidate                    1146
Personal                       1091
Loan                            963
Freedom                         719
Credit Card Loan                713
consolidate                     686
Debt                            665
personal loan                   650
personal                        648
Payoff                          609
Credit Cards                    601
home improvement                584
Debt Consolidation              554
payoff                          549
DEBT CONSOLIDATION              542
My Loan                         527
Credit Card                     527
Home Improvement Loan           523
Name: title, dtype: int64

---
The title column is the title/name of the loan that was chosen by the borrower. Most of the loans have names that are related to the purpose of the loan. Because I already have a feature for loan purpose, I can drop the title column.

---

In [95]:
df.drop('title', axis=1, inplace=True)

In [96]:
df.zip_code.value_counts().head(20)

945xx    9538
750xx    9168
112xx    8473
606xx    7650
300xx    7306
331xx    7142
100xx    6803
900xx    6789
070xx    6723
770xx    6369
891xx    6264
917xx    6083
330xx    6060
104xx    5580
117xx    5498
921xx    5437
852xx    5315
926xx    5129
913xx    5022
925xx    4758
Name: zip_code, dtype: int64

---
I have downloaded median household income per zip code from the US Census Bureau. I will be able to join this to my loan data on this zip column. However, I first need to remove the 'xx' at then end of each record.

---

In [97]:
df.zip_code = df.zip_code.str.replace('xx', '')   # Remove 'xx' from records.

In [98]:
df.zip_code.value_counts().head(10)

945    9538
750    9168
112    8473
606    7650
300    7306
331    7142
100    6803
900    6789
070    6723
770    6369
Name: zip_code, dtype: int64

In [99]:
df.addr_state.unique()

array(['GA', 'CA', 'OR', 'AZ', 'NC', 'TX', 'OH', 'FL', 'VA', 'IL', 'MO',
       'CT', 'UT', 'SC', 'NY', 'PA', 'MN', 'NJ', 'KY', 'RI', 'LA', 'MA',
       'WA', 'WI', 'AL', 'CO', 'KS', 'NV', 'AK', 'MD', 'WV', 'VT', 'MI',
       'DC', 'NH', 'NM', 'AR', 'MT', 'HI', 'WY', 'OK', 'SD', 'DE', 'MS',
       'TN', 'IA', 'NE', 'ID', 'IN', 'ME', 'ND'], dtype=object)

In [100]:
len(df.addr_state.unique())

51

---
addr_state contains the 50 US states plus the federal district DC (District of Columbia)

---

In [101]:
df.revol_util.value_counts().head(10)

0%     3871
53%    1592
58%    1587
57%    1584
54%    1573
61%    1558
48%    1547
59%    1546
52%    1541
47%    1514
Name: revol_util, dtype: int64

---
Like int_rate, the values in revol_util (revolving utilisation rate) are in the form of percentages. However, the records contain the percentage sign (%) which will need to be removed so the column can be converted to float.

---

In [102]:
df.revol_util = df.revol_util.str.replace('%', '')   # Remove '%'.

In [103]:
df.revol_util.value_counts().head(10)

0     3871
53    1592
58    1587
57    1584
54    1573
61    1558
48    1547
59    1546
52    1541
47    1514
Name: revol_util, dtype: int64

In [104]:
df.revol_util = df.revol_util.map(lambda x: float(x))     # Convert column to float.
df.revol_util.dtype

dtype('float64')

In [105]:
df.initial_list_status.value_counts()

w    409434
f    405183
Name: initial_list_status, dtype: int64

---
The initial_list_status values are 'w' and 'f'. This refers to whole loans (funded by one investor) and fractional loans (funded by multiple investors). For ease of interpretation, I will change the values from 'w' and 'f' to 'whole' and 'fractional', respectively.

---

In [106]:
df.initial_list_status = df.initial_list_status.str.replace('w', 'whole')
df.initial_list_status = df.initial_list_status.str.replace('f', 'fractional')

In [107]:
df.initial_list_status.value_counts()

whole         409434
fractional    405183
Name: initial_list_status, dtype: int64

In [108]:
df.disbursement_method.value_counts()

Cash         813534
DirectPay      1083
Name: disbursement_method, dtype: int64

In [109]:
df.policy_code.value_counts()

1.0    814617
Name: policy_code, dtype: int64

---
Even though the policy_code column is a float, the feature itself is categorical. Values of 1 indicate publicly available policy codes whereas values of 2 are meant to indicate policy codes not publicy available. However, my data contains only one value: 1 (publicly available policy codes). Therefore, I can drop this column.

---

In [110]:
df.drop('policy_code', axis=1, inplace=True)

### Date to Age

---
The column earliest_cr_line indicates the date that the borrower's earliest reported line of credit (LOC) was opened. In order to include it in a machine learning model, I will change it from a date to an age, i.e. approximate number of days since the earliest LOC was opened. The age will be relative to the issue date as I want the feature to represent the amount of time between the earliest LOC and the issue date of the Lending Club loan.

---

In [111]:
df['time_since_1st_LOC'] = df.issue_d - df.earliest_cr_line
# New column to represent difference between issue data and date of earliest credit line.

In [112]:
df.time_since_1st_LOC.head(10)

0    4627 days
1    5782 days
2    5813 days
3    2586 days
4    2344 days
5    1795 days
6    2647 days
7    5327 days
8   10530 days
9    5082 days
Name: time_since_1st_LOC, dtype: timedelta64[ns]

---
The difference has been calculated in days. As the both issue_d and earliest_cr_line only listed the month and year, the datetime object listed the day of all records as 1st of the month. Therefore, time_since_1st_LOC is an approximate calculation of number of days rather than the exact number of days.

---

In [113]:
df.time_since_1st_LOC = df.time_since_1st_LOC / np.timedelta64(1, 'D')  # Converts n days to n.

In [114]:
df.time_since_1st_LOC = df.time_since_1st_LOC.map(lambda x: float(x))    # Convert type to float.

In [115]:
df.time_since_1st_LOC.head(10)

0     4627.0
1     5782.0
2     5813.0
3     2586.0
4     2344.0
5     1795.0
6     2647.0
7     5327.0
8    10530.0
9     5082.0
Name: time_since_1st_LOC, dtype: float64

In [116]:
df.drop('earliest_cr_line', axis=1, inplace=True)  # Drop original earliest_cr_line feature.

In [117]:
df.shape

(814617, 33)

---
I have now reduced the number of features to just over 30.

---

In [118]:
df.to_sql(name='LC_Cleaning3', con=engine, if_exists='replace', index = False)

### Match Median Income to Zip Code

---
Now I will map the median household income data to the loan data, joining on zip code.

---

#### Clean Census Zip Codes

---
Firstly, I need to clean the ZCTA's in the census income data. I will need to remove the 'ZCTA5' and the last two digits from the zip code in order to join it to the loan data.

---

In [119]:
SQL_STRING = '''

select * from "all_incomes"

'''

df = pd.read_sql(SQL_STRING, con=engine)

In [120]:
df.head()

,zip,income_2011,income_2012,income_2013,income_2014,income_2015,income_2016,mean_median_household_income
0,ZCTA5 00602,14947.0,15106.0,15663.0,16353.0,16079.0,15106.0,15542.333333
1,ZCTA5 00610,16367.0,16923.0,16707.0,17265.0,17475.0,16923.0,16943.333333
2,ZCTA5 00622,11871.0,12059.0,14281.0,14993.0,15689.0,12059.0,13492.000000
3,ZCTA5 00623,16163.0,16447.0,17389.0,17044.0,16593.0,16447.0,16680.500000
4,ZCTA5 00624,14475.0,15500.0,14768.0,15467.0,15573.0,15500.0,15213.833333

In [121]:
df.shape

(33120, 8)

In [122]:
df.zip = df.zip.str.replace('ZCTA5 ', '')  # Remove 'ZCTA5'.

In [123]:
df.head()

,zip,income_2011,income_2012,income_2013,income_2014,income_2015,income_2016,mean_median_household_income
0,00602,14947.0,15106.0,15663.0,16353.0,16079.0,15106.0,15542.333333
1,00610,16367.0,16923.0,16707.0,17265.0,17475.0,16923.0,16943.333333
2,00622,11871.0,12059.0,14281.0,14993.0,15689.0,12059.0,13492.000000
3,00623,16163.0,16447.0,17389.0,17044.0,16593.0,16447.0,16680.500000
4,00624,14475.0,15500.0,14768.0,15467.0,15573.0,15500.0,15213.833333

In [124]:
df.zip = df.zip.map(lambda x: x[0:3])    # Slice first 3 digits of zip code.

In [125]:
df.head()

,zip,income_2011,income_2012,income_2013,income_2014,income_2015,income_2016,mean_median_household_income
0,006,14947.0,15106.0,15663.0,16353.0,16079.0,15106.0,15542.333333
1,006,16367.0,16923.0,16707.0,17265.0,17475.0,16923.0,16943.333333
2,006,11871.0,12059.0,14281.0,14993.0,15689.0,12059.0,13492.000000
3,006,16163.0,16447.0,17389.0,17044.0,16593.0,16447.0,16680.500000
4,006,14475.0,15500.0,14768.0,15467.0,15573.0,15500.0,15213.833333

In [126]:
df.tail()

,zip,income_2011,income_2012,income_2013,income_2014,income_2015,income_2016,mean_median_household_income
33115,998,75500.0,56667.0,56250.0,56250.0,82813.0,56667.0,64024.500000
33116,998,73000.0,71583.0,71667.0,72868.0,69318.0,71583.0,71669.833333
33117,998,46875.0,49167.0,62813.0,70625.0,54375.0,49167.0,55503.666667
33118,999,54271.0,50875.0,54554.0,57083.0,61908.0,50875.0,54927.666667
33119,999,17639.0,19107.0,19000.0,17946.0,19861.0,19107.0,18776.666667

In [128]:
df.to_sql(name='all_incomes2', con=engine, if_exists='replace', index = False)
# Save to SQL.

#### Join Census to Loans

---
In order to join my loan and census data, I must group the census zip codes to be able to map the incomes to the three digit zip code in the loan data. When grouping the census data by zip code, I will be taking an average of the mean median household income. In order to be able to join the grouped census data to my loan data, I will create an SQL view.

I created a view in pgAdmin4 using the following code:

`create view myview as 
 select zip, avg(mean_median_household_income) as zip_income from "all_incomes2"
 group by zip`
 
This groups by zip so that I have a mean income value for each 3 digit zip code. I will then be able to join this view onto my main dataframe to give me a new feature. The new feature is called zip_income.

---

In [129]:
# Select loan data and view, joining on zip code.
SQL_STRING = '''

select lc.*, mv.zip_income from "LC_Cleaning3" as lc
inner join myview as mv on lc.zip_code = mv.zip

'''

df = pd.read_sql(SQL_STRING, con=engine)

In [130]:
df.head()

,id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,emp_title,emp_length,home_ownership,...,total_acc,initial_list_status,acc_now_delinq,chargeoff_within_12_mths,delinq_amnt,pub_rec_bankruptcies,tax_liens,disbursement_method,time_since_1st_LOC,zip_income
0,2,2500.0,2500.0,2500.0,60 months,15.27,59.83,Ryder,< 1 year,RENT,...,4.0,fractional,0.0,0.0,0.0,0.0,0.0,Cash,4627.0,45064.000000
1,4,10000.0,10000.0,10000.0,36 months,13.49,339.31,AIR RESOURCES BOARD,10+ years,RENT,...,37.0,fractional,0.0,0.0,0.0,0.0,0.0,Cash,5782.0,67071.007246
2,5,3000.0,3000.0,3000.0,60 months,12.69,67.79,University Medical Group,1 year,RENT,...,38.0,fractional,0.0,0.0,0.0,0.0,0.0,Cash,5813.0,55278.303030
3,6,5000.0,5000.0,5000.0,36 months,7.90,156.46,Veolia Transportaton,3 years,RENT,...,12.0,fractional,0.0,0.0,0.0,0.0,0.0,Cash,2586.0,69793.462121
4,7,7000.0,7000.0,7000.0,60 months,15.96,170.08,Southern Star Photography,8 years,RENT,...,11.0,fractional,0.0,0.0,0.0,0.0,0.0,Cash,2344.0,45574.417829

In [131]:
df.shape

(814379, 34)

In [132]:
# Round the averaged median income to the nearest cent.
df.zip_income = df.zip_income.round(2)

In [133]:
# Drop zip code and keep zip_income.
df.drop('zip_code', axis=1, inplace=True)

In [134]:
# Check number of null rows in zip_income.
df.zip_income.isnull().sum()

76

---
There are 76 rows that have null values in zip_income. I will remove these rows.

---

In [135]:
df.dropna(axis=0, how='any', inplace=True)

In [136]:
df.to_sql(name='LC_Cleaning3', con=engine, if_exists='replace', index = False)

### Job Title

---
The emp_title column contains many unique values. I will group these into new categories by looking at some of the most common job titles in the feature.

---

In [137]:
SQL_STRING = '''

select * from "LC_Cleaning3"

'''

df = pd.read_sql(SQL_STRING, con=engine)

In [138]:
df.shape

(814303, 33)

In [139]:
len(df.emp_title.unique())

290645

---
There are more than 290,000 unique job titles in this feature.

---

In [140]:
df.emp_title = df.emp_title.map(lambda x: x.lower())   # Make values lower case.

In [141]:
# Top 40 most common categories in emp_title.
df.emp_title.value_counts().head(40)

teacher                     15042
manager                     14838
owner                        7639
registered nurse             7299
supervisor                   6788
driver                       6561
sales                        6329
rn                           5755
project manager              4573
office manager               4351
general manager              4100
truck driver                 3546
director                     3284
engineer                     3158
sales manager                2742
president                    2708
police officer               2613
operations manager           2571
store manager                2437
vice president               2398
accountant                   2340
administrative assistant     2175
technician                   2092
nurse                        2083
account manager              2065
attorney                     2057
mechanic                     1921
analyst                      1819
assistant manager            1770
executive assistant          1720
branch manager               1626
server                       1594
paralegal                    1528
software engineer            1500
customer service             1435
electrician                  1373
foreman                      1353
operator                     1322
controller                   1311
program manager              1276
Name: emp_title, dtype: int64

In [142]:
# Create a new column for the new job title categories.
df['job'] = df['emp_title']

---
The following function will find all rows that contain a particular string. This will allow me to rename jobs based on index using df.loc.

---

In [143]:
def search(df, *words):
    return df[np.logical_and.reduce([df.str.contains(word) for word in words])]

In [144]:
# Call function to search for records containing 'teacher'.
search(df.job, 'teacher')

903         global teachers research and resources
4677         teachers college, columbia university
8828                               source4teachers
14806     state teachers retirement system of ohio
23401                teachers federal credit union
23634     state teachers retirement system of ohio
24552                             teachers college
32687                     vibe teacher recruitment
36564                                      teacher
36572                                teacher coach
36580                                      teacher
36584                                      teacher
36644                                      teacher
36685                                      teacher
36698                                      teacher
36722                   teacher/guidance counselor
36725                                      teacher
36736                                      teacher
36747                                      teacher
36783                                      teacher
36833                                      teacher
36862                                 head teacher
36908                                      teacher
36923                                      teacher
36928                               teacher/coach
37033                                      teacher
37036                                      teacher
37056                                      teacher
37088                     high school math teacher
37122                                      teacher
                            ...
812707                                     teacher
812708                                     teacher
812714                                     teacher
812825                                     teacher
812832                               math teacher
812836                                     teacher
812905                                     teacher
812951                  teacher family assistants
812982                                     teacher
813031                                     teacher
813086                                     teacher
813102                                     teacher
813179                                     teacher
813212                                     teacher
813248                                     teacher
813286                                     teacher
813347                                     teacher
813353                                     teacher
813531                               teacher admin
813604                                     teacher
813628                                     teacher
813716                                     teacher
813867                                     teacher
813915                                     teacher
813998                                    teacher
814178                                     teacher
814211                                     teacher
814235                                     teacher
814242                                     teacher
814298                                     teacher
Name: job, Length: 18905, dtype: object

---
There are more than 18,905 records with 'teacher' in the job title. There are some 'teacher' records that are recruitment jobs. I will do a separate search for 'recruit'.

---

In [145]:
search(df.job, 'recruit')   # Check recruitment jobs.

32687                   vibe teacher recruitment
37640                         recruiting manager
37797                             army recruiter
37940               vice president of recruiting
38388                                  recruiter
38493                           senior recruiter
38840                           senior recruiter
39126                        technical recruiter
39156        deputy chief, recruiting operations
39690                    sr. technical recruiter
40285                                  recruiter
40562                     recruiting coordinator
40915                     recruiting coordinator
41226                                  recruiter
43988                               sr recruiter
44101                                  recruiter
44522                        corporate recruiter
45923                        territory recruiter
46090           lead customer research recruiter
47086                           senior recruiter
47215                        corporate recruiter
47601                                  recruiter
49161                                  recruiter
50700                           senior recruiter
51055     director of mba admissions/recruitment
51302                                  recruiter
52271                       recruiter/management
53177                               it recruiter
53415               recruiting & retention ncoic
53829                        technical recruiter
                           ...
800940                   sr. technical recruiter
801183                    recruiting coordinator
801399                       technical recruiter
802021                                recruiter
802275                       corporate recruiter
802730                       corporate recruiter
803130                                 recruiter
804128                                 recruiter
806120                                recruiter
806830                                 recruiter
807085                  recruitment coordinator
807811                        recruiting manager
808192                recruiting senior manager
808213                       physician recruiter
809014                 human resources recruiter
810414                                 recruiter
811138                                 recruiter
811332                                 recruiter
811449                                 recruiter
811552                                 recruiter
811901                                 recruiter
811923                                 recruiter
812129    midwife/administrator/senior recruiter
812174                       recruiting director
813061                        sr. tech recruiter
813148                                 recruiter
813227                    director of recruiting
813861                                 recruiter
814180                                 recruiter
814302                       corporate recruiter
Name: job, Length: 1369, dtype: object

---
I now have the index of the 'recruit' jobs. I can rename these records in the job column to 'recruiter' so that they are all grouped as a single category. This will also remove 'teacher' from the recruitment records so that I can group the 'teacher' records as 'teacher' without including recruitment jobs in the teacher category.

---

In [146]:
recruiter = search(df.job, 'recruit').index  # Create object of indexes of 'recruit' jobs.
df.loc[recruiter, 'job'] = 'recruiter'
# Use df.loc to rename job records to 'recruiter' based on 'recruiter' index.

---
With the 'recruit' jobs all renamed to 'recruiter', they have now been removed from the 'teacher' search. I can now rename 'teacher' records to 'teacher' without including any recruitment jobs.

---

In [147]:
teacher = search(df.job, 'teacher').index
df.loc[teacher, 'job'] = 'teacher'

In [148]:
search(df.job, 'assistant')   # Search for assistants.

18643                               call assistant
36554         assistant director - human resources
36560                            medical assistant
36602                     administrative assistant
36710                      sr. executive assistant
36714                             office assistant
36826                          assistant professor
36828                              legal assistant
36847                      assistant store manager
36848     executive assistant to board of director
36855                            medical assistant
36875                          executive assistant
36878                         assistant controller
36883                emergency physician assistant
36937                     administrative assistant
37022                       hs assistant principal
37034     assistant director of document managemen
37086                         front desk assistant
37107                          executive assistant
37128                      assistant store manager
37148              1st assistant golf professional
37153                            medical assistant
37196                          executive assistant
37245                         ophthalmic assistant
37271                            assistant manager
37277                       accounting assistant i
37279                              legal assistant
37321             assistant director of admissions
37349                     adminstrative assistant
37444               underwriting service assistant
                            ...
813605        assistant credit & logistics manager
813620                   assistant billing manager
813624          executive administrative assistant
813633              assistant financial controller
813637                        warehouse assistant
813664                    administrative assistant
813669           assistant manager of maintenance
813675                   assistant project manager
813700                         assistant head chef
813709                               hrm assistant
813717                        foundation assistant
813730                          medical assistant
813774             assistant coordinating manager
813797                             legal assistant
813798                             lab assistant 3
813931                           nursing assistant
813940                         assistant principal
813941                    administrative assistant
813962                     underwriting assistant
813970                         executive assistant
813979                             legal assistant
814007                      assistant store leader
814093                            nurse assistant
814199                   administrative assistant
814220                           project assistant
814225                           assistant manager
814238                           assistant manager
814240                           first assistant b
814288                  certified nurses assistant
814293                           assistant manager
Name: job, Length: 24407, dtype: object

In [149]:
assistant = search(df.job, 'assistant').index
df.loc[assistant, 'job'] = 'assistant'

In [150]:
search(df.job, 'manager')     # Search for managers.

2784                       full circle manager
14365     building owner's manager association
27253          monitor liability managers  llc
36177               jmb financial managers inc
36558                       operations manager
36562                          on road manager
36568                       area sales manager
36569                            parts manager
36574                          project manager
36575             manager information delivery
36591                                  manager
36607                                  manager
36615                             case manager
36624                           senior manager
36631                         category manager
36635                                  manager
36639           project manager & web marketer
36641                                  manager
36646                          general manager
36647                               pr manager
36653                inventory control manager
36659                                  manager
36666                          project manager
36667                   district sales manager
36671                           branch manager
36688             field sales training manager
36690                          account manager
36692                  facilities area manager
36697            international project manager
36704           homecare/hospice nurse manager
                          ...
814147                            area manager
814153                 human resources manager
814154                                 manager
814157                  fiber splicing manager
814162                         fitness manager
814167               territory account manager
814171                         finance manager
814172                      operations manager
814175                          branch manager
814184          operational excellence manager
814186                        property manager
814191                    facilities manager
814198                           sales manager
814203                           sales manager
814205                        treasury manager
814209                           store manager
814210                         general manager
814212                         general manager
814217                                 manager
814223                     sr. manager finance
814224                   it operations manager
814229                           audit manager
814231                         sr plan manager
814237                   field project manager
814263                                 manager
814267           manager reporting & analytics
814270                    corporate it manager
814278                          office manager
814281                           store manager
814284                         account manager
Name: job, Length: 101475, dtype: object

In [151]:
manager = search(df.job, 'manager').index
df.loc[manager, 'job'] = 'manager'

In [152]:
search(df.job, 'nurse')    # Search for nurses.

8201                                 nurse exchange
9911                                  medsol nurses
15126                                 nurse on call
15619                    visiting nurse association
18745           geriatric nurse practitioners, inc.
19583                             village nurseries
19809             visting nurse service of new york
19820                    nurse rx / american mobile
21851                                 nurse on call
22772         visiting nurse association of vt & nh
24970                        calloways nursery, inc
25181                            flowerwood nursery
26402                                 nurse on call
27180                 visiting nurse services of ny
27289                                  pike nursery
28064                                 nurse finders
29370      southern colorado critical care nurses,
32302                              bordines nursery
32370     orlando health visiting nurse association
35159                           access nurses, inc.
35989                              fraleigh nursery
36557                              registered nurse
36579                                    lpn  nurse
36633                              registered nurse
36650                              registered nurse
36656                              registered nurse
36665                          nurse tech/nurse sec
36683                              registered nurse
36999                             registered nurse
37205                                nurse reviewer
                            ...
812852                             registered nurse
812919                                        nurse
812950                                        nurse
813001                            registered nurse
813024                             registered nurse
813034                             registered nurse
813047                           nurse anesthetist
813095                             registered nurse
813209                              registers nurse
813229                             registered nurse
813276                             registered nurse
813377                             registered nurse
813390                             registered nurse
813425                            registered nurse
813451                             registered nurse
813582                             registered nurse
813614                           nurse practitioner
813665                             registered nurse
813696                 registered nurse supervisor
813707                               pdsd nurse aid
813729                             registered nurse
813830                            registered nurse
813921                             registered nurse
813935                             registered nurse
813942                            registered nurse
813946                             registered nurse
814107                             registered nurse
814187                             registered nurse
814195                              nurse navigator
814219                             registered nurse
Name: job, Length: 14073, dtype: object

---
There are a number of nurseries included in this search. I will need to do a separate search for 'nursury' and rename them to remove them from the nursury search.

---

In [153]:
search(df.job, 'nursery')    # Search for nursury.

24970                      calloways nursery, inc
25181                          flowerwood nursery
27289                                pike nursery
32302                            bordines nursery
35989                            fraleigh nursery
80972                        redlands day nursery
87151                  hopewell wholesale nursery
97084           elderberry creek farm and nursery
99474                                pike nursery
102115                            wilsons nursery
102458                      community day nursery
102609                       san jose day nursery
107727                        dupont nursery inc.
124282                         newark day nursery
131039                  a. ferrucci & son nursery
140347                         crisis nursery inc
143616            mesquite valley growers nursery
144935    weecare nursery school and kindergarten
150245                           raintree nursery
153460                     williams plant nursery
155138                         briggs nursery llc
169636                       bell nursery usa llc
177812    racsb - raai/sunnyside nursery & garden
183480                           monrovia nursery
187694                    saguaro country nursery
203475                 marble hill nursery school
362031       educational consultant (pre-nursery)
390148                  infant nursery supervisor
412561                         nursery supervisor
433701                   kitten nursery caregiver
451364                         nursery specalist
451944                             nursery worker
473160                                    nursery
519227    grounds and nursery services specialist
526324                    live nursery specialist
532415                          nursery attendant
566333                    live nursery specialist
764215                        nursery supervisor
778065               landscape/nursery supervisor
793942                        nursery coordinator
Name: job, dtype: object

---
There are only a few records with 'nursery'. I will rename these to 'other'.

---

In [154]:
nursery = search(df.job, 'nursery').index
df.loc[nursery, 'job'] = 'other'      # Rename to 'other'.

In [155]:
nurse = search(df.job, 'nurse').index
df.loc[nurse, 'job'] = 'nurse'

In [156]:
search(df.job, 'owner')   # Search for owners.

3455                       wyndham vacation ownership
13937                      wyndham vacation ownership
18096                      homeowners financial group
19132                           auto-owners insurance
30432                               resales buy owner
33178     community homeownership counseling services
36810                                           owner
39562                                           owner
40197                                owner / operator
40526                                           owner
41109               content owner, business sales ops
41421                                           owner
41679                                   process owner
43086                                owner/worker bee
43327                                           owner
43841                               president / owner
44341                                           owner
44632                                    agency owner
44748                                           owner
47068                                  attorney/owner
47874                   ownership services specialist
49521                                   partner/owner
50907                                           owner
51167                                           owner
51360                                           owner
51846                                           owner
52361                            owner/executive chef
53153                                   product owner
54443                                   owner/gen mgr
55040                                           owner
                             ...
812338                                          owner
812460                                         owner
812466                       managing partner (owner)
812479                                   owner(pres.)
812643                                          owner
812691                                          owner
812803                      owner/instructor/musician
812881                                         owner
812898                                          owner
812978                                          owner
813043                                 owner operater
813048                                          owner
813080                                          owner
813162                                         owner
813198                                president owner
813265                                 attorney/owner
813274                                  daycare owner
813415                                         owner
813526                               owner/proprietor
813528                                          owner
813600                                          owner
813727                                          owner
813792                                          owner
813804                                       co owner
813968                                          owner
814006                                          owner
814083                                  owner/dentist
814090                                          owner
814128                                          owner
814275                                 owner / driver
Name: job, Length: 10407, dtype: object

In [157]:
owner = search(df.job, 'owner').index
df.loc[owner, 'job'] = 'owner'

In [158]:
search(df.job, 'driver')    # Search for drivers.

4992                             driver
19991     redriver federal credit union
36571                            driver
36658                      truck driver
36673                            driver
36677                            driver
36679                   forklift driver
36689                        p&d driver
36700                      truck driver
36748                      truck driver
36760                 school bus driver
36936          therapist/driver trainer
36972                            driver
37038             transportation driver
37078                            driver
37080                package car driver
37137               professional driver
37189                    company driver
37204                            driver
37219                      truck driver
37240                       semi driver
37260                      truck driver
37288                      relay driver
37308                            driver
37383                            driver
37398                      truck driver
37412                     feeder driver
37460                   delivery driver
37502                            driver
37516                     truck driver2
                      ...
813100                           driver
813109                           driver
813127                          driver
813234                           driver
813307                     truck driver
813374                transport driver
813484                     lift driver
813617                           driver
813635                       bus driver
813662                  delivery driver
813681                    truck driver
813712                       dot driver
813814                           driver
813845                 transport driver
813897                           driver
813945                     truck driver
813967                           driver
813974                           driver
813985                driver dispatcher
814023                           driver
814034                           driver
814040                           driver
814051                           driver
814052                     truck driver
814058                           driver
814060                           driver
814067                     truck driver
814085                    truck driver
814140                     truck driver
814185                           driver
Name: job, Length: 16056, dtype: object

In [159]:
driver = search(df.job, 'driver').index
df.loc[driver, 'job'] = 'driver'

In [160]:
search(df.job, 'supervisor')     # Search for supervisors.

1550                                 supervisor
36573              street operations supervisor
36634                           dept supervisor
36657                    gas station supervisor
36676               customer service supervisor
36695                                supervisor
36777                                supervisor
36804                               supervisor
36838                                supervisor
36873               customer service supervisor
36893                            evs supervisor
36992                             ap supervisor
37004                    supervisory k9 officer
37014                          admin supervisor
37120                                supervisor
37126                                supervisor
37158                            job supervisor
37186                     purchasing supervisor
37267                                supervisor
37320     electrical engineer/signal supervisor
37326                         safety supervisor
37337                                supervisor
37347               order processing supervisor
37352                       rn shift supervisor
37357               supervisory program analyst
37380                         hourly supervisor
37428                                supervisor
37435                                supervisor
37455                      graveyard supervisor
37558                         import supervisor
                          ...
813205                               supervisor
813220          supervisory deportation officer
813246                          ramp supervisor
813254                               supervisor
813259                         field supervisor
813262              supervisory patent examiner
813266                               supervisor
813334             dispatch/billing supervisor
813346                    help desk supervisor
813369                     full-time supervisor
813371                         area supervisor
813468                    mainyenace supervisor
813517                              supervisor
813556                    production supervisor
813649                      training supervisor
813684                              supervisor
813760                               supervisor
813821                      service supervisor
813825               loss mitigation supervisor
813831                               supervisor
813839                               supervisor
813889                      dispatch supervisor
813891                               supervisor
813892              channel delivery supervisor
813918                              supervisor
813943                        permit supervisor
814181            quality assurance supervisor
814192                               supervisor
814233          program coordinator/supervisor
814245                        shift supervisor
Name: job, Length: 20335, dtype: object

In [161]:
supervisor = search(df.job, 'supervisor').index
df.loc[supervisor, 'job'] = 'supervisor'

In [162]:
search(df.job, 'director')    # Search for directors.

22304                              white directory
23327                         all star directories
36617                  associate director of sales
36627                           executive director
36632               director, crisis response team
36661                            director of sales
36681                            director of sales
36711              director of strategic marketing
36712                                     director
36724                           marketing director
36764             rn director of surgical services
36790                            director of sales
36796               director of revenue management
36797        director and assoc teaching professor
36798              director, small business center
36805                       director of admissions
36807        planning & inventory control director
36840     senior director, organizational effectiv
36881                  director of human resources
36889                               director of hr
36899     director of social and emotional support
36919                                     director
36939            marketing/communications director
36946                           marketing director
36954                      group account director
36979                       sr. director, presales
37016             director of internet technology
37140              director, it global development
37160        research director/research asst. prof
37175            director of exceptional education
                            ...
813639                                   director
813640                             senior director
813651                           assitant director
813658                              director of it
813674               sr. director, human resources
813721                            director of golf
813743                         head start director
813762                          executive director
813822                          director, it audit
813828           director corp process engineering
813874                       director of marketing
813899                           fiscal director 2
813959                 director regulatory affairs
813977                             deputy director
813982                            program director
814062                        circulation director
814080                   director of rehabilition
814098                             energy director
814109                              store director
814130                    corporate director of hr
814146                         director of av & it
814168                                   director
814182                           activity director
814222                              hotel director
814234                                 it director
814248                                    director
814264                         director wound care
814279             international managing director
814280                               area director
814294                             sports director
Name: job, Length: 25937, dtype: object

---
The 'director' search also included directory and directories jobs. I will rename 'directory' and 'directories' to 'other' to remove them from the 'director' search.

---

In [163]:
directory = search(df.job, 'directory').index
df.loc[directory, 'job'] = 'other'

In [164]:
directories = search(df.job, 'directories').index
df.loc[directories, 'job'] = 'other'

In [165]:
director = search(df.job, 'director').index
df.loc[director, 'job'] = 'director'

In [166]:
search(df.job, 'vice president')     # Search for vice presidents.

36640                              vice president
36772                              vice president
36802                              vice president
36949                              vice president
37030                              vice president
37094                    executive vice president
37209                              vice president
37562                              vice president
37570                              vice president
37822               vice president, due diligence
38070                    vice president, tech ops
38477                              vice president
38783           area vice president of operations
39252                              vice president
39355                 vice president - production
39412                              vice president
39555                              vice president
40281                              vice president
40655                vice president - investments
40984        vice president of technical services
41078             vice president, human resources
41302                             vice president
41350       vice president of property operations
41367                  vice president - marketing
41444                       senior vice president
41628                              vice president
41840                       senior vice president
42032                              vice president
42183                              vice president
42375                    executive vice president
                           ...
810422                     senior vice president
810596                             vice president
810679                             vice president
810711                             vice president
811074                      senior vice president
811105                             vice president
811237                             vice president
811563                             vice president
811578                             vice president
811893                             vice president
811939                vice president of marketing
812041                             vice president
812397                      senior vice president
812518              vice president of engineering
812591                      senior vice president
812886                             vice president
813028                     vice president and coo
813131                             vice president
813303                             vice president
813314                      senior vice president
813466    senior vice president network strategy
813475                   executive vice president
813587                             vice president
813788                      senior vice president
813813                      vice president, sales
813834                      senior vice president
813870                 vice president- operations
814136                            vice president
814207                             vice president
814296                    vice president of sales
Name: job, Length: 4991, dtype: object

In [167]:
vice_pres = search(df.job, 'vice president').index
df.loc[vice_pres, 'job'] = 'vice_pres'
# Rename to 'vice_pres' so that these records not included in future 'president' search.

In [168]:
search(df.job, 'president')      # Search for presidents.

30964                       presidential airways
37129                                  president
37900                                  president
38435                                  president
38533                             vice-president
38803                                  president
38834                                  president
39237                                  president
39539                                  president
40378                                  president
41795                             vice-president
41853                                  president
42040                                  president
42471                                  president
42506                                  president
42550                                  president
42813            chief of staff to the president
43731                                  president
44206                                  president
45040                                  president
45656                           branch president
45739                                  president
46648                                  president
46674                              vicepresident
46678                                  president
48357                                  president
48585                                  president
48610                                  president
49912                                  president
49959                                  president
                           ...
805857                                 president
805967                                 president
806109                                 president
806262                                 president
806534                                 president
806556                                 president
806595                             president/ceo
806722                                 president
807585                                 president
807929                                 president
808675                                 president
808677                     president of staffing
808856                   president of a division
809024                                president
809181                                 president
809202                                 president
809525    vice-president of economic development
809611                                 president
809876                                 president
811328                                 president
811342                                 president
811642                                 president
811788                                 president
812181                                 president
812403                                 president
812563                                 president
812804           presidents club mortgage banker
812856                                 president
813225                                 president
813386                                 president
Name: job, Length: 3439, dtype: object

---
The 'president' search also included 'vice-president' and 'vicepresident'. I will rename these to 'vice_pres' and then rename 'president' search records to 'president'.

---

In [169]:
vice_pres2 = search(df.job, 'vice-president').index
df.loc[vice_pres2, 'job'] = 'vice_pres'

In [170]:
vice_pres3 = search(df.job, 'vicepresident').index
df.loc[vice_pres3, 'job'] = 'vice_pres'

In [171]:
president = search(df.job, 'president').index
df.loc[president, 'job'] = 'president'

In [172]:
search(df.job, 'account')    # Search for accounting jobs.

5                                 mkc accounting
1411               nd accounting & consulting, pc
2246            comprehensive accounting services
2892                         accountmate software
9893                   central accounting norfolk
11048                          ag accounting, llc
16196        texas comptroller of public accounts
18332                         cm2 accounting, llp
21626     defense finance and accounting services
26915                accounting consultants group
33037                          ag accounting, llc
35558               big 4 audit & accounting firm
35570          accounting/financial advisory firm
36622                                  accountant
36662                  department head accounting
36708                                  accountant
36867                     senior staff accountant
36887                           senior accountant
36913                            accounts payable
36915                           account executive
36917                         patient account rep
37012                      billing and accounting
37206                          account management
37407                       senior tax accountant
37418                                  accountant
37456                          general accountant
37511                         accounts receivable
37583                              sr. accountant
37610        specialty pharmacy account executive
37647                                  accountant
                           ...
812463                                 accountant
812546                       technical accountant
812572                                 accountant
812619                                 accountant
812640                    assist vp of accounting
812910                                 accountant
812926                           cash accountant
812992                                 accountant
812995                          senior accountant
813211                      accounting specialist
813224                          account executive
813407                                 accountant
813457                    principal account clerk
813470                restaurant accounting clerk
813507                                 accountant
813590                          staff accountant
813646                  associate cost accountant
813695                          account executive
813754                      accounting specialist
813761                                 accountant
813766            payroll & sales tax accountant
813832                          account executive
813855                         account executive
813954                                 accountant
814011                                 accountant
814108                           accounts payable
814159                                 accountant
814164         enterprise account executive with
814249         supply chain/inventory accounting
814250                     account representative
Name: job, Length: 11612, dtype: object

In [173]:
account = search(df.job, 'account').index
df.loc[account, 'job'] = 'accountant'

In [174]:
search(df.job, 'police')   # Search for police jobs.

1872         borough of prospect park police dept
2306              new york city police department
2720                          chicago police dept
3197            city of durango police department
3436                                dallas police
3483            pocono township police department
3827                       ucsf police department
3995              new york city police department
4311                               clayton police
4595                       south salt lake police
4751           st. louis county police department
4802              new york city police department
5165             clayton county police department
5193                   tuckahoe police department
5321              stevens point police department
5539                      st. louis county police
5666                          raleigh police dept
5969                 monterey airport dist police
6270                         demarest police dept
7245                       bridgeport police dept
7283                            davie police dept
7455              metro transit police department
8169                            united police fcu
8442              new york city police department
8451                   columbus police department
8476                        illinois state police
8957                   richmond police department
9117          village of monroe police department
9364                     los angleles police dept
9370      prince georges county police department
                           ...
811229                            police officer
811415                          police lieutenant
811450                             police officer
811665                            police officer
811727                             police officer
811775                             police officer
811783                             police officer
811955                          detective police
811975                             police officer
812008                            chief of police
812092                             police officer
812295                             police officer
812350                             police officer
812393                             police officer
812450               metropolitan police sergeant
812515                             police officer
812662                             police officer
812749                   master police officer ii
813159                             police officer
813219                            police officer
813317                   police services officer
813493                            police officers
813542                            police sergeant
813643                           police detective
813739                             police officer
813741                             police officer
813925                             police officer
814031                             police officer
814061                             police officer
814190                            police officer
Name: job, Length: 4739, dtype: object

In [175]:
police = search(df.job, 'police').index
df.loc[police, 'job'] = 'police'

In [176]:
search(df.job, 'law')    # Search for law jobs.

34                                sharp lawn inc.
499                             lawrence hospital
1144         wilson ford and lovelace law officce
1594                              lawson software
1916                        naturalawn of america
1984                   uop mcgeorge school of law
2142                                  ip law firm
2343                              toler law group
2442                                     law cash
2570                 the john marshall law school
2647                delaware river port authority
2703            heaven sent lawn maintenance inc.
2775                     secondary school for law
2851                               udm law school
3126       lawrence livermore national laboratory
3187                           lexington law firm
3551                               ramji law firm
3771                aqua sun lawn and landscaping
4224      federal law enforcement training center
4325            greater lawrence technical school
4335             law office of melissa betancourt
4577         law office of cathleen gulledge, llc
4950                                 lawton media
5207                            state of delaware
5651                 law offices of zara jaxavier
6462            delaware valley wholesale florist
6780                          the gibson law firm
7390                     lawyers title of az, inc
7711                     lawrence school district
7737                state of ny department of law
                           ...
775442                            law enforcement
775750                            law-enforcement
778472            federal law enforcement officer
779049              pilot/law enforcement officer
782249                                     lawyer
785007                    law enforcement officer
788720                                     lawyer
789085                            law enforcement
791200                    law enforcement officer
792283                                     lawyer
792677            federal law enforcement officer
793718                        tax law specialist
793975                                  law clerk
795191                    law enforcement officer
797750                                     lawyer
797882                           law enforcement
798506                                     lawyer
798717                      zoning law consultant
799518         law enforcement records technician
800149                             law enforvment
800181                            lawn specialist
802843                          solo law practice
802943    law enforcement communications asistant
804627                serving documentos  lawyer
807200                 law enforcement specialist
808886                            attorney at law
809514                                     lawyer
811086                                     lawyer
811364                              law librarian
812372                                     lawyer
Name: job, Length: 1283, dtype: object

---
The 'law' search also included 'law enforcement' and 'law-enforcement'. I will rename those to 'police'. It also included 'law firm' and 'lawyer'. I will do separate searches for 'law firm' and 'lawyer' as well as 'solicitor' and 'attorney' to create a 'law' category.

---

In [177]:
law_enf = search(df.job, 'law enforcement').index
df.loc[law_enf, 'job'] = 'police'

In [178]:
law_enf2 = search(df.job, 'law-enforcement').index
df.loc[law_enf2, 'job'] = 'police'

In [179]:
search(df.job, 'law firm')   # Search for law firms.

2142                                        ip law firm
3187                                 lexington law firm
3551                                     ramji law firm
6780                                the gibson law firm
8422                           joyce and reyes law firm
8562                                  stelzner law firm
10282                            brooks pierce law firm
10383                                 daphneys law firm
11832                                          law firm
12099                              howard rice law firm
12191                                   o'neil law firm
12561                                          law firm
13009                               spottswood law firm
15027                                          law firm
15843                                          law firm
17086                                          law firm
17464                                    small law firm
24554                           washington, dc law firm
27523                            pandell law firm  inc.
27528                         mustell & borrow law firm
29014                      the smith foote law firm llp
29282                     zakheim & associates law firm
29652                             mcnair law firm  p.a.
32099                             weston adams law firm
32367                           law firm of howard rice
33853     law firm with offices ny, la, dc and overseas
36455                         long established law firm
74032                                    edgar law firm
77565                                          law firm
78718                              the kaufman law firm
                              ...
161247                                         law firm
163066                       andril & espinosa law firm
165613                               the monge law firm
173001                             medium size law firm
177693                     law firm of randall isenberg
178264                             ludwig law firm, plc
178731                                         law firm
179378                                         law firm
180445                johnson-gilchrist law firm, p.c.
182133                                  mclane law firm
182904                                 pursley law firm
183403                                         law firm
184856                         the woods law firm, p.a.
185516               bramnick rodriguez, et al law firm
186985                               the chang law firm
187899                                   large law firm
188845                               northwest law firm
190345                        law firm ghostwriter, llc
193654                                         law firm
195319                                 soloway law firm
197416                            peissel law firm, llp
198143                          hite and stone law firm
198483                                   blatz law firm
198744                              the bailey law firm
199001                                         law firm
200418                        oliver & weidner law firm
205969         mitchell  and  associates law firm  pllc
206217                        simmons & holmes law firm
278261                           law firm administrator
278726                           the mcdonnell law firm
Name: job, Length: 122, dtype: object

In [180]:
search(df.job, 'lawyer')   # Search for lawyers.

7390                  lawyers title of az, inc
9065            your jacksonville lawyer, p.a.
45549                                   lawyer
57298                                   lawyer
60726                                   lawyer
86137     los angeles dependency lawyers, inc.
89396                            rocket lawyer
95362                 minnesota lawyers mutual
126618          your jacksonville lawyer, p.a.
130735           international lawyers network
173153    san diego county bar lawyer referral
183705           international lawyers network
191335       texas lawyers' insurance exchange
202200                   american lawyer media
216337                                  lawyer
219540                                  lawyer
223762                          lawyer-partner
226916                                  lawyer
234620                                  lawyer
238691                                  lawyer
244164                                  lawyer
250707                                  lawyer
252946                                  lawyer
259850                                  lawyer
261515                                  lawyer
268011                                  lawyer
268063                                  lawyer
270660                                  lawyer
274063                                  lawyer
280151                                  lawyer
                          ...
677802                                 lawyer
679897                    environmental lawyer
681420                                  lawyer
682591                                  lawyer
682988                                  lawyer
688763                                  lawyer
699226                                 lawyer
699399                                  lawyer
706085                                  lawyer
706375                                  lawyer
708230                                  lawyer
719542                                  lawyer
723434                                  lawyer
725464                         lawyer- counsel
735051                         attorney lawyer
736576                                  lawyer
738918                                  lawyer
744811                                  lawyer
754486                                 lawyer
767563                           senior lawyer
774333                                  lawyer
782249                                  lawyer
788720                                  lawyer
792283                                  lawyer
797750                                  lawyer
798506                                  lawyer
804627             serving documentos  lawyer
809514                                  lawyer
811086                                  lawyer
812372                                  lawyer
Name: job, Length: 153, dtype: object

In [181]:
search(df.job, 'solicitor')    # Search for solicitors.

152295    9th circuit solicitor's office -berkeley
299968                                   solicitor
386428                    associate city solicitor
504562                              bail solicitor
532567                    associate city solicitor
562663                              loan solicitor
686916                                   solicitor
Name: job, dtype: object

In [182]:
search(df.job, 'attorney')    # Search for attorneys.

299          kings county district attorney's office
354                            ohio attorney general
1201              attorneys title fund services, llc
2143                          texas attorney general
4542                  utah attorney general's office
8366                    ct attorney general's office
11145       granowitz white & weber attorneys at law
11325                           leigh hart  attorney
13229                            us attorneys office
14420             richard w. gibson, attorney at law
15902                                 state attorney
19918        kings county district attorney's office
20063                         u.s. attorney's office
21261        ganowitz white & weber attorneys at law
22702                     attorney james golden, jr.
23781        6th judicial district attorney's office
24369           19th circuit state attorney's office
24720     connors and sullivan attorneys at law pllc
24907       dept. of justice/attorney general office
24990               suffolk county district attorney
27192                   ct attorney general's office
27726              la plata county district attorney
28788                 tulsa county district attorney
29975                    fresno co district attorney
30113             wa state attorney general's office
31750                office of the district attorney
31916                        state attorney's office
32838                                   561 attorney
32909                 ohio attorney general's office
33287            wa state office of attorney general
                             ...
807340                               senior attorney
807644                            associate attorney
807696                                      attorney
807854                                     attorney
807877                                     attorney
808075                                      attorney
808664                                      attorney
808886                               attorney at law
809088                          deputy city attorney
809190                                      attorney
809294                            associate attorney
809346                                      attorney
809867                                      attorney
810314                                      attorney
810380                                      attorney
810502                                      attorney
810912                           attorney specialist
811038                                      attorney
811572                                      attorney
811735                                      attorney
812206                                      attorney
812559                                      attorney
812697                                      attorney
813156                                      attorney
813175                                      attorney
813228                                      attorney
813972                                      attorney
813997                                      attorney
814196                                      attorney
814277                          attorney/shareholder
Name: job, Length: 3170, dtype: object

In [183]:
law_firm = search(df.job, 'law firm').index
df.loc[law_firm, 'job'] = 'law'

In [184]:
lawyer = search(df.job, 'lawyer').index
df.loc[lawyer, 'job'] = 'law'

In [185]:
solicitor = search(df.job, 'solicitor').index
df.loc[solicitor, 'job'] = 'law'

In [186]:
attorney = search(df.job, 'attorney').index
df.loc[attorney, 'job'] = 'law'

In [187]:
search(df.job, 'bank')   # Search for bank jobs.

22                             wells fargo bank
39                                citizens bank
139                            bank of the west
169                                     us bank
202                         jpmorgan chase bank
209                        jp morgan chase bank
244            first national bank of st. louis
275                kearny ferderal savings bank
362                       sterling savings bank
410                                m and t bank
433                 national bank of california
460                                  chase bank
464                             bank of america
486                             bank of america
494                                     us bank
705                             bank of america
784                            bank of oklahoma
786       coldwell banker residential brokerage
883          coldwell banker pacific properties
917                            food bank of cny
918                                     us bank
953                          city national bank
969                        sound community bank
993                     commerzbank ag new york
1010                  jpmorgan chase bank & co.
1076                             metro bankstae
1116                            home state bank
1152                        first republic bank
1204                                  home bank
1312               hopkins federal savings bank
                          ...
807496                   bankruptcy specialist
807565                           premier banker
807704                      mortgage bank assoc
808066                      sr universal banker
808356                                   banker
808417                  financial health banker
808426                               answerbank
808525                                   banker
809221                          personal banker
809383                          personal banker
809423                          personal banker
809586                          personal banker
810231                            senior banker
810310                          personal banker
810529                          personal banker
810580                                   banker
810665                          mortgage banker
811006                 vp small business banker
811140                          personal banker
811688                     relationship banker
811726                                   banker
811863                      relationship banker
811918                                   banker
812040                           license banker
812414                           digital banker
812984                     relationship banker
813426            electronic banking specialist
813511                           premier banker
813747                          personal banker
813981                                   banker
Name: job, Length: 7074, dtype: object

---
The 'bank' search also included 'food bank' jobs which I will rename to 'other'. It also included 'coldwell banker' which is a real estate company. I will do separate searches for 'coldwell banker', 'real estate', 'property', and 'properties' and rename them to 'property'. I can then rename remaining 'banker' records to 'banker'.

---

In [188]:
search(df.job, 'food bank')  # Search for food banks.

917                           food bank of cny
8112                     north texas food bank
22465                     the food bank of wma
31152                southeast texas food bank
92302     food bank of contra costa and solano
99448                         placer food bank
100785              georgia mountain food bank
108534                    harvesters food bank
117076             atlanta community food bank
120118             atlanta community food bank
130528               blue ridge area food bank
140900                          utah food bank
176853                        oregon food bank
178271                            ct food bank
185118                     community food bank
Name: job, dtype: object

In [189]:
food_bank = search(df.job, 'food bank').index
df.loc[food_bank, 'job'] = 'other'

In [190]:
search(df.job, 'coldwell banker')  # Search for Coldwell Banker jobs.

786          coldwell banker residential brokerage
883             coldwell banker pacific properties
2791                          coldwell banker bain
30241            coldwell banker the aspen brokers
30568                              coldwell banker
30698                              coldwell banker
33216                              coldwell banker
35037                              coldwell banker
85423                 coldwell banker d'ann harper
95441                          coldwell banker one
101363                 coldwell banker west realty
103203                 coldwell banker real estate
103688                             coldwell banker
112662                             coldwell banker
115897                 coldwell banker real estate
116072                 coldwell banker west realty
126220                 coldwell banker real estate
127346            coldwell banker united, realtors
133178       coldwell banker residential brokerage
135248                             coldwell banker
138292     coldwell banker hamilton and associates
142273                             coldwell banker
144500                             coldwell banker
146797            coldwell banker/charlie ricketts
149349                            coldwell banker
151934              coldwell banker c&c properties
153373                             coldwell banker
163048                   coldwell banker - realogy
174488                        coldwell banker west
183142                       coldwell banker caine
201751    coldwell banker howard perry and walston
Name: job, dtype: object

In [191]:
search(df.job, 'real estate')    # Search for real estate jobs.

168                          edgestone real estate
2999                   commercial real estate firm
4270              greenstreet real estate partners
4834                        devonshire real estate
5513         american real estate associates, inc.
5526                       wells real estate funds
7124                            insite real estate
8082                            hecker real estate
9233                       wells real estate funds
10664                           simons real estate
11963                 green real estate group, llc
13353                 green real estate group  llc
13421      washington real estate investment trust
13680                 vintage real estate services
14757                            asset real estate
16301                          pinkham real estate
22579                              bnc real estate
24849          pcv murcor - real estate appraisals
26836           boston and north shore real estate
28700       grubb and ellis commercial real estate
29938            colorado springs team real estate
31812                   coast real estate services
32879                       real estate associates
33595                           inland real estate
34104                          pemboke real estate
35888                inland real estate group inc.
42071                        real estate appraiser
44407     credit assistance real estate specialist
44532                            real estate agent
46637                            real estate agent
                            ...
782971                           real estate agent
783107                       real estate paralegal
784014                           real estate sales
786420              real estate salesperson/broker
786797                         real estate analyst
786803                          real estate broker
787278                      real estate specialist
787708                           real estate agent
788550                                real estate
789424                        real estate services
789552                           real estate agent
790000                    real estate professional
791225                 real estate closing officer
792441                       real estate appraiser
792793             real estate sales/mortgage loan
793425                          real estate broker
794126               real estate lending associate
796623                           real estate agent
800225                           real estate sales
801229              real estate investor / realtor
802425                         real estate closer
802439                           real estate agent
803996                           real estate agent
807894                       real estate paralegal
808073            licensed real estate salesperson
808586                  avp of real estate lending
809299                       real estate paralegal
809989           commercial real estate appraiser
811393                           real estate agent
812610                 licensed real estate broker
Name: job, Length: 611, dtype: object

In [192]:
search(df.job, 'property')     # Search for property jobs.

733            gilchrist county property appraiser
1652           lighthouse property management inc.
5242                        simpson property group
5730      optimum professional property management
6479                  investment property vultures
8678                 schernecker property services
9719                west coast property management
10682                     chesapeake property cons
10818                      h&j property management
10852                         simon property group
14411                   lamden property management
15587                hmmy property management corp
15784                  assurant specialty property
15948                      sts property management
18003                               boxer property
19080                   celtic property management
19381                  g&k property management llc
21988                schernecker property services
22535                 lewis property management co
23249         palm beach county property appraiser
24565                       liberty property trust
25094               hmmy property management corp.
25306                          copt property mgmt,
27820          goldrich & kest property management
31487                 american property management
31552                 ppa property services i, llc
38984     vp development, property development cen
44172                       property administrator
44551                   property valuation analyst
45714                          property controller
                            ...
768291                         property researcher
768920                         property management
769013                property disposal specialist
771845                  junior property specialist
772022                             property manger
773930                                   property
774506                        property management
774554                      property administrator
775360                    regional property manger
777209          transit property protection agent
778413                         property bookkeeper
780022          supv. property disposal specialist
780229              personal property appraiser ii
780573      independant property casualty adjustet
782010                       regional property mgr
785394                      property administrator
787951                          property appraiser
788401                           property adjuster
794211                         property researcher
794289                          property appraiser
796035                        property maintenance
797181                    property claims adjuster
799964                     property and office mgr
800001                           property assessor
801606                     property tax specialist
805135                          property appraiser
806250                                property mgt
806392                                property mgr
810425                          property technican
813840                          property custodian
Name: job, Length: 452, dtype: object

In [193]:
search(df.job, 'properties')   # Search for properties.

547                       heritage properties inc.
883             coldwell banker pacific properties
2298                     usa properties fund, inc.
2822                           jl properties, inc.
3390                 liberty investment properties
3716      professional properties management, inc.
4423                       branch properties, inc.
5014                          southwind properties
5400                           st. john properties
6489                          tarantino properties
7095                          bre properties, inc.
7588                     starpoint properties, llc
7653                                avr properties
7665                          lion properties, llc
7923                      sudberry properties, inc
8321                             kohner properties
8846              national retail properties, inc.
12270                            gordon properties
15090                         fairfield properties
15265                         bre properties  inc.
16545                prudential rubloff properties
17219                        brookfield properties
19440                           echelon properties
21204                         stateside properties
21710           school investment properties, inc.
21723                          usa properties fund
22693                         safeguard properties
24606                    st. john properties  inc.
25196                    forester properties, inc.
27343                               sos properties
                            ...
185592                      tiner properties, inc.
186066                      bob schmitz properties
187615                        weinstein properties
188074    leisure properties llc (crownline boats)
188439                           indcor properties
190175                       tiner properties, inc
190458                     golden state properties
190932           school investment properties, inc
191191                              rdb properties
191353                         woodmont properties
191802                        millbrook properties
192836                         edgewood properties
192874                       brookfield properties
193191               hudgins family properties llc
193491                         mcglamry properties
195625                             mtnt properties
198856                         galloway properties
200151                          village properties
201674                       mila properties inc.
201907                         heritage properties
202222                           warren properties
204630                             home properties
205168                          richman properties
205704                           monday properties
247794                    properties administrator
445599             intellectual properties analyst
511705                    take care of properties
609490                    mass properties engineer
655441                        vp of ioa properties
673912                                  properties
Name: job, Length: 196, dtype: object

In [194]:
cold_bank = search(df.job, 'coldwell banker').index
df.loc[cold_bank, 'job'] = 'property'

In [195]:
real_estate = search(df.job, 'real estate').index
df.loc[real_estate, 'job'] = 'property'

In [196]:
properties = search(df.job, 'properties').index
df.loc[properties, 'job'] = 'property'

In [197]:
properties2 = search(df.job, 'property').index
df.loc[properties2, 'job'] = 'property'

In [198]:
banker = search(df.job, 'banker').index
df.loc[banker, 'job'] = 'banker'

In [199]:
search(df.job, 'consultant')   # Search for consultants.

24                 winfield pathology consultants
2525                           matrix consultants
2970             expert technical consultants inc
3762                        princeton consultants
4354                        geosyntec consultants
4505                 scheduling consultants, ltd.
4666                  texas inpatient consultants
6460      critical care and pulmonary consultants
6811                 icon information consultants
7751                          spectal consultants
8727           environ strategy consultants, inc.
9262               all world language consultants
10379                       geosyntec consultants
10601             coastal engineering consultants
10811                       geosyntec consultants
11982                monument medical consultants
12372               parish anesthesia consultants
15584              aegis construction consultants
15746          leighfisher management consultants
16733                consultant engineering, inc.
17688                        epc consultants, inc
17961               christopher consultants, ltd.
18262        computer consultants of america, inc
18266                            icon consultants
19290                  cummings riter consultants
19584                      jdm system consultants
19806                          mgroup consultants
20728            medical device consultants, inc.
21019                  security consultants group
24474      baker engineering and risk consultants
                           ...
811067                                 consultant
811100                      investment consultant
811310                            data consultant
811347                          senior consultant
811448              operational policy consultant
811468                  environmental consultant
811754                   premiere loan consultant
811773                                 consultant
811842                          senior consultant
811910                        mortgage consultant
811966                    compensation consultant
812100                sr merchandising consultant
812292                    field energy consultant
812302                                 consultant
812404                          search consultant
812410                        business consultant
812413                           sales consultant
812532                                 consultant
812538                              it consultant
812794                                 consultant
812986                          senior consultant
813088                              consultant ii
813174                          senior consultant
813584                                 consultant
813597                          senior consultant
813908                    avp, project consultant
813983     licensed financial guidance consultant
814079                                 consultant
814119                      consultant negotiator
814244                  regional sales consultant
Name: job, Length: 7566, dtype: object

In [200]:
consultant = search(df.job, 'consultant').index
df.loc[consultant, 'job'] = 'consultant'

In [201]:
search(df.job, 'engineer')    # Search for engineers.

315                                  jacobs engineering
336                          us army corps of engineers
1066                         us army corps of engineers
2457                            pacific engineers group
2772                    milwaukee school of engineering
2932                  plant engineering and maintenance
3023                         us army corps of engineers
3101                nei contracting & engineering, inc.
3904           ebert & baumann consulting engineers, in
4000                                sunrise engineering
4027                     r. g. vanderweil engineers llp
4301                              truevance engineering
4510                       us army aviation engineering
4705                        becht engineering co., inc.
4865                    madison county engineers office
5160                       engineered machined products
5449      florence  and  hutcheson consulting engineers
5934                               ccjm engineers, ltd.
6560                     earth engineering incorporated
6665                                   able engineering
6801                       engineering associates, inc.
6858                                   engineers outlet
7046                                  cedar engineering
7076                           aqua-serv engineers, inc
7156            jsa civil environmental engineers, inc.
7234                                  engineer profiles
7237                            marlin engineering, inc
7472                                  ahtna engineering
7642                       u.s. army corps of engineers
8165              thyssenkrupp system engineering, inc.
                              ...
813288                                         engineer
813293                           data storage engineer
813297                                  safety engineer
813367                     civil engineering technician
813469                           feild service engineer
813485                             supervising engineer
813499                                 permits engineer
813510                                      it engineer
813561                           engineering technician
813585                                         engineer
813610                                        engineer
813650                         tooling/process engineer
813663                            mechanical engineer 3
813698                         senior network engineer
813735                                 project engineer
813736                             sr software engineer
813744                                         engineer
813756                                         engineer
813777                                  field engineer
813778                         senior security engineer
813809                          client support engineer
813843                               solutions engineer
813848                               senior ui engineer
813919                            optimization engineer
813927                               design engineering
813956                            applications engineer
814050                                 marine engineer
814183                                software engineer
814189                              sr network engineer
814285                     senior inside sales engineer
Name: job, Length: 20900, dtype: object

---
The 'engineer' search also included army engineers. I will do a separate search for 'army' and rename 'army' search jobs to 'army'.

---

In [202]:
search(df.job, 'army')      # Search for army jobs.

70                       tx army national guard
153                                     us army
331                                     us army
336                  us army corps of engineers
644                                   u.s. army
684                         army national guard
724                      16th mp bde, u.s. army
922                          department of army
972                                     us army
1045                                  u.s. army
1066                 us army corps of engineers
1132                                  u.s. army
1179                                    us army
1262                                    us army
1371                                   us army
1374                                    us army
1389                                    us army
1443                                    us army
1499                                  u.s. army
1585                         the salvation army
1751                         united states army
1887                                  u.s. army
1944                                    us army
2006                                   u.s.army
2058                                       army
2073                                  u.s. army
2114                                       army
2172                        united states army
2262                                    us army
2277                                  u. s army
                          ...
629899                          army instructor
635051                    army jrotc instructor
640632    department of the army civilian gs 14
644122                      army signal officer
649454                          us army officer
650486             jrotc senior army instructor
655086                             army officer
659439                       army staff officer
666676                                     army
673538                   senior army instructor
674305                                 u.s army
691322             us army operations sergeant
706625                      army court reporter
720694                                     army
729030                   senior army instructor
734161                                     army
739418                              active army
748049                          us army officer
750450                                  us.army
750693                                     army
757431                   army commissed officer
759199                               army medic
762473                                     army
765413                                     army
769999              career advisor/retired army
780221                   senior army instructor
792178                                     army
809331                                     army
809337                             army officer
811948                             army officer
Name: job, Length: 1787, dtype: object

In [203]:
army = search(df.job, 'army').index
df.loc[army, 'job'] = 'army'

In [204]:
engineer = search(df.job, 'engineer').index
df.loc[engineer, 'job'] = 'engineer'

In [205]:
search(df.job, 'technician')     # Search for technicians.

36567                    surgical technician
36577          technician support specialist
36581                        hvac technician
36589                       alarm technician
36664                       field technician
36693                             technician
36751                     network technician
36794                  spacecraft technician
36817               mental health technician
36866                      supply technician
36900          regulatory affairs technician
36916                    pharmacy technician
36948                 electronics technician
36996               tire and lube technician
37045                     service technician
37327          industrial hygiene technician
37334                  board test technician
37336                        hvac technician
37491                  electronic technician
37571        certified ophthalmic technician
37602               human service technician
37660                             technician
37693                     process technician
37756     video teleconferencing technician
37799             human resources technician
37843                    pharmacy technician
37852                             technician
37869                    pharmacy technician
37911                  anesthesia technician
37918                     spindle technician
                         ...
812814                     fiscal technician
812826                    carrier technician
812840                          technician 2
812849                     fiscal technician
812943           water treatment technician
813033                           technician
813036           quality gage lab technician
813117                       data technician
813124                 industrial technician
813133                 irrigation technician
813311                      technician fiber
813325                  histology technician
813368                calibration technician
813440                      tower technician
813518                    quality technician
813592                data center technician
813603                enforcement technician
813641                           technician
813653                            technician
813654                       lead technician
813660                   lead lab technician
813666                veterinary technician
813838               production technician 2
813842             health service technician
813947              process engr. technician
814170                  pharmacy technician
814236    veterinary or surgery technician 2
814291                  installer technician
814292                       engr technician
814300                   it field technician
Name: job, Length: 13132, dtype: object

In [206]:
technician = search(df.job, 'technician').index
df.loc[technician, 'job'] = 'technician'

In [207]:
search(df.job, 'mechanic')   # Search for mechanics.

2942                                    mechanical inc
3596                                forsyth mechanical
5095                   highland mechanical contractors
6100                                    rac mechanical
6720                     mdm mechanical services, inc.
7500                            performance mechanical
8413                            mechanical contractors
8528                                   city mechanical
10200     westmoreland mechanical testing and research
13621                             ppc mechanical seals
15016                                renkow mechanical
16166                                elvins mechanical
16869                                  hart mechanical
17152                       armistead mechanical, inc.
17547                                delta mechanical
17922                     mdm mechanical services, inc
19739                                  lusk mechanical
20462                            interstate mechanical
23379                         howard's mechanical inc.
23926                                   mechanics bank
24856                            orion mechanical inc.
25324                             burns mechanical inc
25326                         venture mechanical, inc.
25495                                cooper mechanical
28332                             avc mechanical sales
28481                              teamwrkx mechanical
30682                            mill creek mechanical
30751                                   mechanical inc
31460                  tp mechanical contractors, inc.
32224                                    ic mechanical
                              ...
810468                             propulsion mechanic
810584                                 welder mechanic
810762                                       mechanic
810985                    electro-mechanical assembler
811112                                       mechanic
811260                              corrosion mechanic
811280                              air craft mechanic
811298                     flight operations mechanic
811556                              mechanic appeared
811692                               aircraft mechanic
811750                                        mechanic
811904                            maintenance mechanic
812007                                 senior mechanic
812207                                   auto mechanic
812221                                        mechanic
812635                            maintenance mechanic
812685                         sr. mechanical designer
812690                                        mechanic
812752                             equipment mechanic
813261                                        mechanic
813339                               general mechanic
813354                                      mechanic 1
813427                               aircraft-mechanic
813473                                       mechanic
813704                            electronics mechanic
813719                                  mechanic oiler
813916                             aircraft mechanic 2
814008                                        mechanic
814069                             insulation mechanic
814102                               mechanical helper
Name: job, Length: 4967, dtype: object

In [208]:
mechanic = search(df.job, 'mechanic').index
df.loc[mechanic, 'job'] = 'mechanic'

In [209]:
search(df.job, 'sales')    # Search for sales jobs.

775                      aarons sales and lease
1030                   acosta sales & marketing
1953                  norris sales company inc.
2556                           hayes auto sales
2571                           hayes auto sales
3008              quaker sales and distribution
3741                          costco wholesales
3777                                  mvp sales
6737                            oasis sales inc
8728            advantage sales  and  marketing
9111                       harlequin sales corp
9354                 all-state ford truck sales
12161                uniform sales assoc., inc.
12563                       sheridan ford sales
15239                       walter's auto sales
17147                        chapman ford sales
17302                       comins lumber sales
18071                  aaa electric motor sales
18496                      get fresh sales, inc
18741               stainless sales corporation
19133                            cellular sales
19177                            salesforce.com
19459                            salesforce.com
20003             advantage sales and marketing
21234                    aarons sales and lease
21781     modern door and equipment sales, inc.
23028                              johnco sales
23219                            salesforce.com
24288                   c & b sales and service
25372                    aarons sales and lease
                          ...
812930                 regional sales executive
812931                sales / operations leader
812963                          sales executive
812973                           sales/designer
813054                          sales associate
813108                                   sales
813139                         sales/schedueler
813150                                    sales
813166                                   sales
813208                  senior sales executive
813263                                    sales
813305                                    sales
813379                      parts counter sales
813462                      sales administrator
813602                          insurance sales
813608                                    sales
813609                                    sales
813638                                   sales
813755                                    sales
813757                         sales associates
813767                                   sales
813837                               sales rep
814004                                    sales
814024                clinical sales specialist
814045                        club fitter/sales
814046                   sales representative 2
814087                                    sales
814103                                   sales
814208           vp sales strategy & operations
814287                            sales trainer
Name: job, Length: 17324, dtype: object

In [210]:
sales = search(df.job, 'sales').index
df.loc[sales, 'job'] = 'sales'

In [211]:
search(df.job, 'analyst')    # Search for analysts.

35447                    analysts inernational
36576                    lead business analyst
36598                             data analyst
36599                               it analyst
36618                          systems analyst
36651             information security analyst
36729                             data analyst
36738                    reimbursement analyst
36753                    senior policy analyst
36813                    credit review analyst
36827                           equity analyst
36865                    sr. business analyst
36922                               analyst ii
36924                                  analyst
36945                    financial analyst iii
36952                   senior systems analyst
36969                 meas & reporting analyst
36978                           credit analyst
36981                  sr supply chain analyst
37152                     applications analyst
37159                                analyst 2
37161                    programmer analyst ii
37197                         software analyst
37207                        financial analyst
37361                          billing analyst
37391                               qa analyst
37410                         business analyst
37442                         security analyst
37458                                  analyst
37476                       programmer analyst
                          ...
813160                                analyst
813201                            wage analyst
813240                              analyst ii
813342                            case analyst
813373               quality assurance analyst
813432                        business analyst
813461                        security analyst
813495                computer support analyst
813549                 senior business analyst
813577                hr compliance analyst ii
813679                            data analyst
813680           senior transportation analyst
813711                     sr business analyst
813728    business analyst, network operations
813742                    quantitative analyst
813759                                 analyst
813807                        business analyst
813869                windows platform analyst
813880                       intraday analyst
813930                 senior business analyst
813939                          budget analyst
813952                   replenishment analyst
813964                        warranty analyst
814017                      compliance analyst
814022                        business analyst
814106                      compliance analyst
814131                                 analyst
814156          management and program analyst
814163        marketing and operations analyst
814290                                 analyst
Name: job, Length: 19031, dtype: object

In [212]:
search(df.job, 'scientist')    # Search for scientists.

36856                        biological scientist
36858                          forensic scientist
36993                    bioinformatics scientist
38339                          research scientist
38986     method development specialist-scientist
39205                          research scientist
40122                        research scientist i
40193                            senior scientist
41095        senior clinical laboratory scientist
41230                                   scientist
41339                            pharma scientist
41920               clinical laboratory scientist
42693                        biomedical scientist
43308                              data scientist
44344                      clinical lab scientist
44847                                   scientist
44905                        research scientist 3
45221                associate research scientist
45892                                   scientist
45947                          research scientist
46138                      sr. research scientist
46282                          research scientist
46395               clinical laboratory scientist
46462                          research scientist
46903                            senior scientist
51464                            senior scientist
51939        senior process development scientist
52272                                   scientist
52919                      clinical lab scientist
54528                                scientist ii
                           ...
797795                         research scientist
798242                             data scientist
798438                                  scientist
799806                         clin lab scientist
803274                         forensic scientist
804350                                  scientist
805244                          protein scientist
805458                                  scientist
805530                senior associate scientist
806046                        principal scientist
806404                             lead scientist
806433                         research scientist
806593               medical laboratory scientist
806664                  senior computer scientist
807298                                  scientist
807355                      forensic scientist ii
807504         lead clinical laboratory scientist
807705                               scientist ii
808055                        clinical scientist
808541              clinical laboratory scientist
808670                             data scientist
808963                       scientist/researcher
810140                         research scientist
810559                                  scientist
810737                       chief data scientist
811477                         research scientist
811991                           senior scientist
813282                           senior scientist
813583                        principal scientist
814033                         research scientist
Name: job, Length: 1053, dtype: object

In [213]:
analyst = search(df.job, 'analyst').index
df.loc[analyst, 'job'] = 'analyst'

In [214]:
scientist = search(df.job, 'scientist').index
df.loc[scientist, 'job'] = 'scientist'

In [215]:
search(df.job, 'customer service')    # Search for customer service jobs.

4238               new customer service companies
15205                      apac customer services
29290                      apac customer services
30852       governor's office of customer service
36603             customer service representative
36606                        customer service rep
36927                            customer service
37330                    customer service/drafter
37875                            customer service
38043                            customer service
38181                 team lead, customer service
38273                      customer service agent
38315                           customer service
38735                            customer service
39192                customer service-call center
39203                        customer service rep
39509                            customer service
39569                            customer service
39676                            customer service
39734                        customer service rep
39899                   lead customer service rep
39987                        customer service rep
40028                            customer service
40130                            customer service
40394                        customer service rep
40404                        customer service rep
40479                            customer service
40660                      customer service agent
40676             customer service representative
40697                        customer service rep
                           ...
810482                          customer service
810668            customer service representative
810695    customer service administrative officer
810872                     customer service agent
810974                       customer service rep
811032                          customer service
811064                           customer service
811145                 customer service associate
811308            customer service representative
811339                  billing customer service
811496                   sr. customer service rep
811541            customer service representative
811667                           customer service
811958           customer service representative
812216                           customer service
812363                       customer service sme
812536                 lease customer service rep
812769                     customer service agent
812816                           customer service
812830                          customer service
812902                           customer service
813238            customer service representative
813242            customer service representative
813255                 customer service associate
813358                           customer service
813412                           customer service
813434           customer service representative
813769       customer service has nfornation desk
813868              customer service representive
813878                           customer service
Name: job, Length: 3888, dtype: object

In [216]:
customer_service = search(df.job, 'customer service').index
df.loc[customer_service, 'job'] = 'customer service'

In [217]:
search(df.job, 'electrician')    # Search for electricians.

34518                        union electrician
36682                              electrician
36843                              electrician
36929                              electrician
37021                              electrician
37106                   electrician aprrentice
37199                       master electrician
37649                   journeyman electrician
37695                              electrician
37866                   journeyman electrician
38195                              electrician
38491                              electrician
38525                  maintanence electrician
39246                      nuclear electrician
39284                              electrician
39388                              electrician
39422                   industrial electrician
39935                              electrician
40119                     aircraft electrician
40156                              electrician
40641                    utilities electrician
40887                              electrician
41780                   journeyman electrician
42404                   journeyman electrician
42431                      foreman electrician
42440                              electrician
42771                      utility electrician
42797                              electrician
43153                              electrician
43576                             electrician
                          ...
805735                             electrician
805917                             electrician
806165                             electrician
806462                            electrician
806774                    electrician's helper
807430                  journeyman electrician
807432                             electrician
807986                             electrician
808238                            electrician
808266                   overhead electrician
808651                             electrician
809111                  journeyman electrician
809270                maintanence electrician
809598                            electrician
809617                             electrician
809847                  journeyman electrician
809857                             electrician
810172                 journeyman electrician
811189                             electrician
811221                             electrician
811370    interior communications electrician
811654                             electrician
811717                             electrician
811810                             electrician
812058                             electrician
812288                             electrician
812366                             electrician
812883                             electrician
813819                             electrician
813924                             electrician
Name: job, Length: 2177, dtype: object

In [218]:
electrician = search(df.job, 'electrician').index
df.loc[electrician, 'job'] = 'electrician'

In [219]:
search(df.job, 'operator')    # Search for operators.

36630                    plant operator
36728                        operator 3
36803                 bottomer operator
36868            manufacturing operator
36879                equipment operator
36903                  laborer/operator
36905                      operator/itr
36914                      bus operator
36959                       ip operator
37143                     line operator
37290                          operator
37331                        operator 2
37345                          operator
37370          heavy equipment operator
37555                  machine operator
37731                          operator
37741                equipment operator
37761               journeyman operator
37813                          operator
37823                          operator
37861        2nd class network operator
37931                equipment operator
37946                  machine operator
38062                       operator ii
38072              fire engine operator
38085                          operator
38228     machine operator / timekeeper
38241                2nd press operator
38352                        b operator
38390              asst-plant  operator
                      ...
812321             power plant operator
812412              palletizer operator
812422                 printer operator
812625                    key operator
812649             equipment 2 operator
812661                   plant operator
812693        integrated truck operator
812774                    bus operator
812914                forklift operator
813003            equipment operator ii
813050                     bus operator
813085                    bus operator
813099                    dock operator
813142                 machine operator
813155                         operator
813189              mold press operator
813190      chief operator exelon power
813197                utility operator
813298              equipment operator
813363                   crane operator
813562                         operator
813748        specialist, uas operator
813817                     bus operator
813965                   modus operator
813966          senior control operator
813995                computer operator
814020                   train operator
814132            operator/receptionist
814143                     lmf.operator
814151                 forklif operator
Name: job, Length: 9581, dtype: object

---
I will not group the operators as these jobs are too diverse to be grouped into one category.

---

I now have a number of the most common jobs as new categories. These categories are: 'recruiter', 'teacher', 'assistant', 'manager', 'nurse', 'owner', 'driver', 'supervisor', 'director', 'vice_pres' [vice president], 'president', 'accountant', 'police', 'law', 'property', 'banker', consultant', 'army', 'engineer', 'technician', 'mechanic', 'sales', 'analyst', 'scientist', 'customer service', and 'electrician'.

I will set all other values to 'other'.

---

In [220]:
# Rename job titles to 'other' if it is not one of the new categories.
df.job = df.job.map(lambda x: 'other' if x not in ['recruiter', 'teacher', 'assistant', 'manager', 'nurse',
                                                   'owner', 'driver', 'supervisor', 'director', 'vice_pres',
                                                   'president', 'accountant', 'police', 'law', 'property',
                                                   'banker', 'consultant', 'army', 'engineer', 'technician',
                                                   'mechanic', 'sales', 'analyst', 'scientist', 'customer service',
                                                   'electrician'] else x)

In [221]:
df.job.value_counts()

other               457397
manager             101475
director             25911
assistant            24407
engineer             20852
supervisor           20335
analyst              19031
teacher              18904
sales                17324
driver               16056
nurse                14033
technician           13132
accountant           11612
owner                10407
consultant            7566
vice_pres             5106
police                5016
mechanic              4967
customer service      3888
law                   3452
president             3324
banker                2439
electrician           2177
army                  1787
recruiter             1369
property              1285
scientist             1051
Name: job, dtype: int64

In [222]:
# Drop original emp_title column and keep new job column.
df.drop('emp_title', axis=1, inplace=True)

In [223]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 814303 entries, 0 to 814302
Data columns (total 33 columns):
id                          814303 non-null int64
loan_amnt                   814303 non-null float64
funded_amnt                 814303 non-null float64
funded_amnt_inv             814303 non-null float64
term                        814303 non-null object
int_rate                    814303 non-null float64
installment                 814303 non-null float64
emp_length                  814303 non-null object
home_ownership              814303 non-null object
annual_inc                  814303 non-null float64
verification_status         814303 non-null object
issue_d                     814303 non-null datetime64[ns]
loan_status                 814303 non-null int64
purpose                     814303 non-null object
addr_state                  814303 non-null object
dti                         814303 non-null float64
delinq_2yrs                 814303 non-null float64
inq_last_6mths              814303 non-null float64
open_acc                    814303 non-null float64
pub_rec                     814303 non-null float64
revol_bal                   814303 non-null float64
revol_util                  814303 non-null float64
total_acc                   814303 non-null float64
initial_list_status         814303 non-null object
acc_now_delinq              814303 non-null float64
chargeoff_within_12_mths    814303 non-null float64
delinq_amnt                 814303 non-null float64
pub_rec_bankruptcies        814303 non-null float64
tax_liens                   814303 non-null float64
disbursement_method         814303 non-null object
time_since_1st_LOC          814303 non-null float64
zip_income                  814303 non-null float64
job                         814303 non-null object
dtypes: datetime64[ns](1), float64(21), int64(2), object(9)
memory usage: 205.0+ MB

In [224]:
df.to_sql(name='LC_Cleaning4', con=engine, if_exists='replace', index = False)

---
The dataset is now clean. I can now move onto the second part of the EDA, plotting and analysing the data to look at distributions and relationships between variables.

---